{
  "id": "brothers",
  "category": "human-interest",
  "title": {
    "urdu": "23 گھنٹے کا سفر اور 60 برس بعد دو بھائیوں کی پہلی ملاقات جس میں 'خوشی کے سوا کچھ نہ تھا'",
    "english": "A 23-Hour Journey and a First Meeting Between Two Brothers After 60 Years That Was 'Nothing But Happiness'"
  },
  "vocabulary": {
    "گھنٹے": "hours",
    "سفر": "journey",
    "برس": "years",
    "برسوں": "years",
    "بعد": "after",
    "بھائیوں": "brothers",
    "بھائی": "brother",
    "بھائیو": "brothers",
    "ملاقات": "meeting",
    "خوشی": "happiness",
    "ہزار": "thousand",
    "طویل": "long",
    "خاص": "special",
    "انتظار": "waiting",
    "ویلز": "Wales",
    "گھر": "home",
    "آسٹریلیا": "Australia",
    "شہر": "city",
    "برسبین": "Brisbane",
    "لمحہ": "moment",
    "لمحے": "moment",
    "لمحات": "moments",
    "مشکل": "difficult",
    "فطری": "natural",
    "کرسمس": "Christmas",
    "خاندان": "family",
    "خاندانی": "family",
    "جشن": "celebration",
    "یادگار": "memorable",
    "لندن": "London",
    "والدین": "parents",
    "پیدا": "born",
    "پیدائش": "birth",
    "وقت": "time",
    "عمر": "age",
    "شادی شدہ": "married",
    "شادی": "marriage",
    "بدنامی": "shame",
    "گود لینے": "adoption",
    "پرورش": "upbringing",
    "بہن": "sister",
    "زندہ": "alive",
    "دنیا": "world",
    "زندگی": "life",
    "حقیقت": "truth",
    "سچ": "truth",
    "اصل": "real",
    "تلاش": "search",
    "ڈی این اے ٹیسٹ": "DNA test",
    "رشتے": "relationship",
    "رشتہ": "relationship",
    "والدہ": "mother",
    "کینسر": "cancer",
    "دن": "day",
    "دنوں": "days",
    "یقین": "belief",
    "راز": "secret",
    "صدمے": "shock",
    "صدمہ": "shock",
    "بیٹا": "son",
    "بیٹے": "son",
    "بیٹوں": "sons",
    "سکول": "school",
    "بچے": "children",
    "بیٹی": "daughter",
    "کوشش": "effort",
    "کامیاب": "successful",
    "خدوخال": "features",
    "افراد": "people",
    "خفگی": "resentment",
    "تلخی": "bitterness",
    "احساسات": "feelings",
    "احساس": "feeling",
    "مختلف": "different",
    "پریشان": "worried",
    "تشویش": "worry",
    "سالگرہ": "birthday",
    "جذباتی": "emotional",
    "خوش": "happy",
    "قیمتی": "precious",
    "تقدیر": "destiny",
    "ہفتوں": "weeks",
    "ہفتے": "week",
    "کافی": "enough",
    "شاندار": "wonderful",
    "ناقابلِ یقین": "unbelievable",
    "تین": "three"
  },
  "paragraphs": [
    {
      "urdu": "یہ 10 ہزار میل فاصلے کا ایک طویل سفر تھا جو 23 گھنٹے میں طے ہوا مگر اس کی سب سے خاص بات وہ ملاقات تھی جو 60 برس سے زیادہ عرصے کے انتظار کے بعد ممکن ہوئی۔ رسل گوور نے بالآخر اپنے بڑے بھائی سے پہلی بار بالمشافہ ملاقات کر لی۔",
      "english": "It was a long journey of 10 thousand miles that took 23 hours, but the most special part was the meeting that became possible after more than 60 years of waiting. Russell Gower finally met his older brother face-to-face for the first time."
    },
    {
      "urdu": "اس ماہ کے آغاز میں 64 سالہ رسل نے جنوبی ویلز میں واقع اپنے گھر سے آسٹریلیا کے شہر برسبین کا سفر کیا تاکہ اپنے 69 سالہ بھائی پیٹر سے مل سکیں۔",
      "english": "At the start of this month, 64-year-old Russell traveled from his home in South Wales to the city of Brisbane in Australia to meet his 69-year-old brother Peter."
    },
    {
      "urdu": "لیکن یہ لمحہ کسی طرح بھی غیر مانوس یا مشکل نہیں تھا۔ رسل نے اسے فطری قرار دیتے ہوئے کہا کہ 'اس لمحے میں خوشی کے سوا کچھ نہیں تھا۔'",
      "english": "But this moment was not in any way unfamiliar or difficult. Russell described it as natural, saying: 'There was nothing but happiness in that moment.'"
    },
    {
      "urdu": "برسوں سے بچھڑے دونوں بھائیوں کی ملاقات اب باضابطہ طور پر کرسمس ڈے پر برسبین میں ایک بڑے خاندانی جشن کے ذریعے یادگار بنائی گئی۔",
      "english": "The meeting of the two brothers separated for years was now made memorable through a large family celebration on Christmas Day in Brisbane."
    },
    {
      "urdu": "دونوں بھائی لندن میں والدین رے اور جل کے ہاں پیدا ہوئے۔ پیٹر کی پیدائش اس وقت ہوئی جب جل کی عمر صرف 15 برس تھی اور یہ جوڑا ابھی شادی شدہ نہیں تھا۔",
      "english": "Both brothers were born to parents Ray and Gill in London. Peter's birth happened at a time when Gill was only 15 years old and the couple was not yet married."
    },
    {
      "urdu": "1950 کی دہائی میں یہ بدنامی کی بات سمجھی جاتی تھی اور اسی وجہ سے پیٹر کو کسی کو گود لینے کے لیے دیا گیا اور یوں وہ آسٹریلیا لے جائے گئے جہاں ان کی پرورش ہوئی۔",
      "english": "In the 1950s, this was considered a matter of shame, and for this reason Peter was given up for adoption and was taken to Australia where he was raised."
    },
    {
      "urdu": "رے اور جل نے بعد میں شادی کر لی اور ان کے ہاں چند برسوں میں رسل پیدا ہوئے۔ اس کے بعد ایک بہن جیکی بھی پیدا ہوئی، جو اب زندہ نہیں جبکہ رے اور جل بھی دنیا میں نہیں رہے۔",
      "english": "Ray and Gill got married afterward and Russell was born to them within a few years. After that, a sister Jackie was also born, who is no longer alive, while Ray and Gill have also left this world."
    },
    {
      "urdu": "پیٹر نے اپنی زندگی کا زیادہ تر حصہ آسٹریلیا میں گزارا اور وہ اس حقیقت سے بے خبر رہے کہ ان کا اصل خاندان کون ہے تاہم چند برس پہلے ان کی بہن نے انھیں اس سچ سے آگاہ کیا۔ اس کے بعد ان کی پوتی نے رسل کو تلاش کیا اور پھر ڈی این اے ٹیسٹ کے ذریعے دونوں کے رشتے کی تصدیق کی گئی۔",
      "english": "Peter spent most of his life in Australia and remained unaware of the truth about who his real family was, until a few years ago when his sister informed him of this truth. After that, his granddaughter searched for Russell and then confirmed the relationship between them through a DNA test."
    },
    {
      "urdu": "رسل کو اپنی بہن نے نوعمری میں بتایا تھا کہ ان کا ایک بھائی بھی ہے لیکن ان کی والدہ نے کبھی براہِ راست پیٹر کے بارے میں بات نہیں کی۔",
      "english": "Russell's sister had told him in his youth that he also has a brother, but their mother never directly talked about Peter."
    },
    {
      "urdu": "2007 میں جب وہ کینسر کے باعث زندگی کے آخری دن گزار رہی تھیں تو انھوں نے رسل سے کہا 'مجھے تمہیں ایک بات بتانی ہے۔'",
      "english": "In 2007, when she was spending her last days of life due to cancer, she said to Russell: 'I need to tell you something.'"
    },
    {
      "urdu": "رسل کا یقین ہے کہ ان کی والدہ انھیں ان کے بھائی کے بارے میں بتانا چاہتی تھیں لیکن وہ یہ راز کھولنے سے پہلے ہی دنیا سے رخصت ہو گئیں۔",
      "english": "Russell believes that his mother wanted to tell him about his brother, but she departed from this world before she could reveal this secret."
    },
    {
      "urdu": "رسل کے مطابق 'میری والدہ اس واقعے سے یقیناً شدید صدمے میں تھیں حالانکہ مجھے کبھی اس کا اندازہ نہیں ہوا۔ آخرکار انھوں نے میری بہن کو بتایا۔ مجھے نہیں معلوم کہ ان حالات میں اپنا ایک بچہ کھو دینے کے بعد وہ اپنی زندگی کس طرح گزار پائی تھیں۔'",
      "english": "According to Russell: 'My mother was certainly in severe shock from this incident, although I never realized it. Eventually, she told my sister. I don't know how she managed to live her life after losing a child in those circumstances.'"
    },
    {
      "urdu": "'وہ یقیناً ہر دن سوچتی ہوں گی کہ ان کا ایک بیٹا کیا کر رہا ہو گا۔ اس کا سکول کا پہلا دن کیسا رہا ہو گا؟ کیا اس کے بچے ہوئے؟ یہ سب کچھ ان کے لیے بہت ہی مشکل رہا ہو گا۔'",
      "english": "'She must have thought every day about what her son might be doing. What was his first day of school like? Did he have children? All of this must have been very difficult for her.'"
    },
    {
      "urdu": "رسل ایک بیکری میں ریٹیل آپریشنز مینیجر رہ چکے ہیں۔ وہ شادی شدہ اور ایک بیٹی کے والد ہیں لیکن پہلی ملاقات کے لیے وہ اکیلے آسٹریلیا گئے۔ انھوں نے کئی برس پہلے آسٹریلیا میں اپنے بھائی کو تلاش کرنے کی کوشش کی تھی لیکن وہ کوشش کامیاب نہ ہو سکی۔",
      "english": "Russell had been a retail operations manager at a bakery. He is married and father of a daughter, but he went to Australia alone for the first meeting. He had made an effort to search for his brother in Australia several years ago, but that effort was not successful."
    },
    {
      "urdu": "بالآخر وہ لمحہ آیا جب دونوں بھائی برسبین میں پیٹر کے گھر کے باہر ڈرائیو وے پر مصافحہ کرتے ہوئے ملے۔ ان دونوں کے جسمانی خدوخال حیرت انگیز طور پر ایک جیسے تھے۔ ملاقات کا یہ یادگار منظر ان رشتہ داروں نے کیمروں میں محفوظ کیا جنھوں نے اس ملاقات کا انتظام کرنے میں مدد کی تھی۔",
      "english": "Finally, that moment came when both brothers met while shaking hands in the driveway outside Peter's home in Brisbane. Their physical features were surprisingly similar. This memorable scene of the meeting was captured on camera by relatives who had helped arrange this meeting."
    },
    {
      "urdu": "اب 17 افراد پر مشتمل یہ پورا خاندان کرسمس ڈے پر ایک بڑے جشن کے لیے جمع ہوا۔",
      "english": "Now this entire family of 17 people gathered for a big celebration on Christmas Day."
    },
    {
      "urdu": "رسل کا کہنا ہے کہ ملاقات سے پہلے وہ کچھ کشمکش کا شکار تھے تاہم ان کے بھائی نے کہا کہ وہ گود لیے جانے کے بارے میں کسی قسم کی خفگی یا تلخی نہیں رکھتے۔",
      "english": "Russell says that before the meeting he was experiencing some inner conflict, however his brother said that he holds no resentment or bitterness about being given up for adoption."
    },
    {
      "urdu": "اپنے احساسات بیان کرتے ہوئے رسل نے کہا کہ 'ہمارا خون کے رشتے کے علاوہ کوئی تعلق نہیں تھا۔ وہ دنیا کے دوسرے کنارے پر بالکل مختلف زندگی گزار رہا ہے اور اس کی پرورش مجھ سے الگ ہوئی۔ اس لیے میں تھوڑا پریشان تھا کہ یہ سب کیسے ہو گا لیکن میری تشویش فوراً دور ہو گئی۔'",
      "english": "Describing his feelings, Russell said: 'We had no connection other than a blood relationship. He is living a completely different life on the other side of the world and his upbringing was separate from mine. So I was a bit worried about how this would all go, but my worry was immediately dispelled.'"
    },
    {
      "urdu": "ان کے مطابق 'جب میں نے اس سے ہاتھ ملایا اور اس نے میرا کندھا تھاما تو مجھے فوراً احساس ہوا۔ اس میں کچھ خاص تھا۔ ایسا لگا جیسے ہم ایک ہی طرح سے جُڑے ہوئے ہیں۔'",
      "english": "According to him: 'When I shook his hand and he held my shoulder, I immediately had a feeling. There was something special about it. It felt like we were connected in the same way.'"
    },
    {
      "urdu": "انھوں نے کہا کہ 'جب میں نے پیٹر کو بتایا کہ یہ دن ان کی والدہ کی 85ویں سالگرہ ہوتا تو اس وقت دونوں کچھ جذباتی ہو گئے۔'",
      "english": "He said: 'When I told Peter that this day would have been their mother's 85th birthday, at that time both of us became somewhat emotional.'"
    },
    {
      "urdu": "رسل نے کہا 'یہ محض اتفاق تھا کہ ہم نے اس دن ایک ساتھ اچھا وقت گزارا جو ہماری والدہ کی 85ویں سالگرہ ہوتی۔ ہمارے ستارے جیسے ایک ساتھ مل گئے تھے۔'",
      "english": "Russell said: 'It was merely a coincidence that we spent a good time together on the day that would have been our mother's 85th birthday. Our stars had aligned.'"
    },
    {
      "urdu": "'مجھے یقین ہے کہ وہ بہت خوش ہوتیں اگر اپنے دونوں بیٹوں کو بیئر پیتے اور باتیں کرتے دیکھتیں۔ یہ کسی قیمتی خزانے جیسا لمحہ تھا۔ یہ حقیقتاً تقدیر ہے۔ میں اپنی پوری زندگی گزار کر بھی کبھی اسے نہ ڈھونڈ پاتا اور اب اچانک ہم یہاں ہیں۔'",
      "english": "'I believe she would have been very happy seeing both her sons drinking beer and talking. It was a moment like a precious treasure. This is truly destiny. I could have spent my entire life and never found him, and now suddenly we are here.'"
    },
    {
      "urdu": "اتنے زیادہ موضوعات پر بات کرنے کے ساتھ دونوں سوچنے لگے ہیں کہ آیا تین ہفتوں کا دورہ کافی ہو گا۔",
      "english": "With so many topics to talk about, both have started wondering if a three-week visit will be enough."
    },
    {
      "urdu": "رسل نے کہا کہ 'اس نے میری دنیا بدل دی۔ یہ اس سے بہتر وقت پر نہیں آ سکتا تھا۔ ہفتے کا کوئی بھی دن شاندار ہوتا لیکن کرسمس پر وہاں مدعو ہونا واقعی خاص ہے۔ میں نے کبھی نہیں سوچا تھا کہ کبھی ایسا ہو پائے گا لیکن اب میں کرسمس ڈے پر اپنے بھائی کے ساتھ باربی کیو کروں گا۔ یہ ناقابلِ یقین مگر شاندار لمحات ہیں۔'",
      "english": "Russell said: 'This has changed my world. It couldn't have come at a better time. Any day of the week would have been wonderful, but being invited there on Christmas is really special. I never thought this would ever be possible, but now I'll be having a barbecue with my brother on Christmas Day. These are unbelievable but wonderful moments.'"
    }
  ]
}
