{
  "id": "chura-sharif",
  "category": "interview",
  "title": {
    "urdu": "چورا شریف انٹرویو - حضرت پیر حیدر شاہ صاحب",
    "english": "Chura Sharif Interview - Hazrat Pir Haider Shah Sahib"
  },
  "vocabulary": {},
  "paragraphs": [
    {
      "urdu": "اب میں حضرت قبلہ پیر سید محمد شبیر علی شاہ صاحب گیلانی کی خدمت عالیہ میں عرض",
      "english": "Now I will humbly request in the blessed presence of Hazrat Qibla Pir Syed Muhammad Shabbir Ali Shah Sahib Gilani"
    },
    {
      "urdu": "کروں گا کہ اپ ہمارے دلوں کی تشنگی دور فرمائیں اور حضرت بابا علی صاحب کے حالات",
      "english": "that you quench the thirst of our hearts and enlighten us about the life of Hazrat Baba Ali Sahib"
    },
    {
      "urdu": "زندگی سے ہمیں منور کریں ہمارے قلوب و اذان کو نعرہ تکبیر",
      "english": "illuminate our hearts and minds. Nara-e-Takbeer!"
    },
    {
      "urdu": "اللہ اکبر نعرہ رسالت",
      "english": "Allahu Akbar! Nara-e-Risalat!"
    },
    {
      "urdu": "یا رسول اللہ نعرہ تکبیر",
      "english": "Allahu Akbar! Nara-e-Risalat!"
    },
    {
      "urdu": "اللہ اکبر نعرہ رسالت",
      "english": "Ya Rasool Allah! Nara-e-Takbeer!"
    },
    {
      "urdu": "یا رسول اللہ استانہ عالیہ چورہ شریف زندہ باد",
      "english": "Ya Rasool Allah! Long live Astana Aaliya Chura Sharif!"
    },
    {
      "urdu": "نحمدہ ونصلی علی رسولہ الکریم اما بعد فاعوذ باللہ السمیع العلیم وسلطان",
      "english": "We praise Him and send blessings upon His Noble Messenger. After that, I seek refuge in Allah the All-Hearing, All-Knowing, the Most Noble"
    },
    {
      "urdu": "الکریم من الشیطان علی الرجیم بسم اللہ الرحمن",
      "english": "from Satan the accursed. In the name of Allah, the Most Gracious"
    },
    {
      "urdu": "الرحیم سب سے پہلے میں یہ",
      "english": "the Most Merciful. First of all, I..."
    },
    {
      "urdu": "پروقار اور سادہ سی تقریب بس سلسلہ انٹرویو",
      "english": "this dignified and simple ceremony, in the series of interviews"
    },
    {
      "urdu": "کوئسچن سوالات و جواب کے سلسلے میں ان بچوں نے",
      "english": "questions and answers, in this connection these young people"
    },
    {
      "urdu": "ویب سائٹ چورہ شریف نے منعقد کی",
      "english": "Website Chura Sharif organized this"
    },
    {
      "urdu": "سبحان اللہ اور",
      "english": "Subhan Allah! And"
    },
    {
      "urdu": "دعا بھی ہے کہ اللہ کرے بھی یہ ان کا سلسلہ جو ہے یہ دراز رہے اور چلتا رہے",
      "english": "I also pray that may Allah keep this series of theirs going and continuing"
    },
    {
      "urdu": "امین جس ہستی کے متعلق اج یہ انٹرویو ہو رہا ہے",
      "english": "Ameen. The personality about whom this interview is being conducted today"
    },
    {
      "urdu": "سوالات و جوابات ہو رہے ہیں ان کا",
      "english": "questions and answers are being asked"
    },
    {
      "urdu": "مقام ان کی عظمت ان کی شان",
      "english": "their status, their greatness, their glory"
    },
    {
      "urdu": "بس صرف اتنا ہے کہ ان کی عظمت شان جو ہے وہ بیان کر کے ہم نے اپنے دلوں کو",
      "english": "The purpose is simply this - that by describing their greatness and glory, we want to enlighten our hearts"
    },
    {
      "urdu": "قلوب و اذہان کو منور کرنا ہے سبحان اللہ",
      "english": "and minds. Subhan Allah!"
    },
    {
      "urdu": "چونکہ پہلے میں اکثر یہ بات عرض کر چکا ہوں",
      "english": "Since I have often mentioned before"
    },
    {
      "urdu": "کہ دربار عالیہ چورہ شریف سلسلہ عالیہ نقشبندیہ مجددیہ کا ایک مرکز ہے کیپیٹل ہے",
      "english": "that Darbar Aaliya Chura Sharif is a center, a capital of the exalted Naqshbandiyya Mujaddidiyya order"
    },
    {
      "urdu": "جس سے ہزاروں لاکھوں لوگ فیضیاب ہوئے",
      "english": "from which thousands and millions of people have benefited"
    },
    {
      "urdu": "سبحان اللہ فیضیاب ہوتے رہیں گے",
      "english": "Subhan Allah! They will continue to benefit"
    },
    {
      "urdu": "سبحان اللہ فیضیاب ہو رہے ہیں",
      "english": "Subhan Allah! They are benefiting now"
    },
    {
      "urdu": "سبحان اللہ سبحان اللہ اج ذرا سی کسی بھی تصوف کے ساتھ مس رکھنے",
      "english": "Subhan Allah! Subhan Allah! Today anyone who has any connection with Sufism"
    },
    {
      "urdu": "والا یا دل کے اندر صوفیاء کی محبت رکھنے والا",
      "english": "or who holds love for the Sufis in their heart"
    },
    {
      "urdu": "کسی سلسلے سے بھی اس کا تعلق ہے کسی سلسلے کا بھی وہ غلام ہے کسی بزرگ کو صوفی کو وہ",
      "english": "whoever belongs to any spiritual order, whoever is a servant of any saint"
    },
    {
      "urdu": "دیکھنے والا ہے تو میں بڑے وثوق سے یہ بات کہوں گا",
      "english": "whoever follows a Sufi, I will say with great confidence"
    },
    {
      "urdu": "کہ جب چورہ شریف کا نام لیا جائے ذکر چھڑ جائے",
      "english": "that when Chura Sharif's name is mentioned, when its discussion begins"
    },
    {
      "urdu": "تو ایسا کوئی عالم دین ہو صوفی ہو تصوف سے مت رکھتا ہو تو یہ ہو نہیں سکتا کہ وہ",
      "english": "there cannot be any scholar, any Sufi, anyone connected to Sufism who is unaware of Chura Sharif"
    },
    {
      "urdu": "چورہ شریف کے سے ناواقف ہو سبحان اللہ",
      "english": "Subhan Allah!"
    },
    {
      "urdu": "ایک صدی سے اوپر وقت گزر گیا چورہ شریف کو اباد ہوئے",
      "english": "More than a century has passed since Chura Sharif was established"
    },
    {
      "urdu": "سبحان اللہ سبحان اللہ سبحان اللہ اور یہ سلسلہ اج تک فیضان نقشبندیہ مجددیہ",
      "english": "Subhan Allah! Subhan Allah! Subhan Allah! And this chain continues till today - the blessings of Naqshbandiyya Mujaddidiyya are being distributed"
    },
    {
      "urdu": "خیرات بٹ رہی ہے یہ کوئی زبانی جمع خرچ نہیں ہے میرا کہ میں کوئی زبانی جمع خرچ",
      "english": "This is not mere talk, I am not just speaking empty words"
    },
    {
      "urdu": "کر رہا ہوں افتاب امد دلیل افتاب",
      "english": "The sun has come - the evidence of the sun itself"
    },
    {
      "urdu": "کہ بابا جی تاجدار چورہ شریف اپ کی اولاد پاک نے",
      "english": "That Baba Ji, the crown of Chura Sharif, your blessed progeny"
    },
    {
      "urdu": "ہمارے اباؤ اجداد نے کہ لاکھوں کو فیضیاب کیا یہ کوئی صرف بات ایک حد لکھنے کے یا",
      "english": "our forefathers have blessed millions - this is not just something to write or speak about"
    },
    {
      "urdu": "بولنے کی حد تک نہیں ہے یہ دیکھ لیں کہ اس وقت ال انڈیا",
      "english": "This is not limited to words - look at that time, all of India"
    },
    {
      "urdu": "کا دور افغانستان سے لے کے",
      "english": "that era, from Afghanistan"
    },
    {
      "urdu": "چار دانگ عالم بالخصوص ہندوستان تک ایران تک",
      "english": "to the four corners of the world, especially to Hindustan, to Iran"
    },
    {
      "urdu": "شام اور ترکی تک یہ سلسلہ فیض جو تھا کہ بابا جی صاحب نے یا ان کے خدام اور غلام",
      "english": "to Syria and Turkey - this chain of blessings that Baba Ji Sahib or his servants and devotees"
    },
    {
      "urdu": "نے غلاموں نے پہنچایا ہے سبحان اللہ",
      "english": "the devotees have spread. Subhan Allah!"
    },
    {
      "urdu": "سبحان اللہ مگر حربہ رسیدی یہ ٹھہری کہ چونکہ حالات",
      "english": "Subhan Allah! But there was a difficulty - since the circumstances were such"
    },
    {
      "urdu": "کچھ ایسے تھے جن کا میں ہلکا سا اشارہ کروں گا کہ اس",
      "english": "which I will briefly mention"
    },
    {
      "urdu": "وقت گورنمنٹ سے حکومت سے ٹکر لینی کوئی اسان",
      "english": "that at that time, confronting the government was not an easy task"
    },
    {
      "urdu": "کام نہیں تھا مگر روایات مجددی کو زندہ کیا اور وہ دعوت",
      "english": "But the Mujaddidi traditions were kept alive and that invitation letter"
    },
    {
      "urdu": "نامہ یا حکومت کی اطاعت قبول کرو یا پھر اپنے اپ کو مہاجر بنا لو۔ حکومت کی اطاعت",
      "english": "either accept the government's authority or become a migrant. They did not accept the government's authority"
    },
    {
      "urdu": "قبول نہیں کی۔ اس وقت جو حکومت تھی وہ غیر مسلم تھی۔ حکومت کی اطاعت نہیں کی۔ ورنہ",
      "english": "The government at that time was non-Muslim. They did not submit to the government. Otherwise"
    },
    {
      "urdu": "اس دور کے ہزاروں لوگ جو تھے۔ انہوں نے اطاعت قبول کی جو اج",
      "english": "thousands of people of that era accepted their authority, who today are playing among thousands and millions"
    },
    {
      "urdu": "ہزاروں اور لاکھوں میں کھیل رہے ہیں۔ سبحان اللہ۔",
      "english": "Subhan Allah!"
    },
    {
      "urdu": "مگر بابا جی تاجدار چورہ شریف نے ارشاد فرمایا کہ میں در مصطفی کا گدا ہوں۔",
      "english": "But Baba Ji, the crown of Chura Sharif, declared that I am a beggar at the door of Mustafa"
    },
    {
      "urdu": "اللہ اکبر اس سے بڑھ کر میری کوئی میراث نہیں",
      "english": "Allahu Akbar! I have no greater inheritance than this"
    },
    {
      "urdu": "اور میراث اگر ہے تو یہ میری ایک ٹوٹی ہوئی چٹائی ہے۔",
      "english": "And if I have any inheritance, it is this torn mat of mine"
    },
    {
      "urdu": "یہ کندھے پہ رکھنے والی ایک میری گودڑی ہے، کمبل ہے اور یہ ایک میرا لوٹا پانی",
      "english": "This blanket on my shoulder, this old cloth, and this water pot of mine"
    },
    {
      "urdu": "والا ہے۔ یہ متا مجھ سے کوئی چھین نہیں سکتا۔",
      "english": "No one can take this away from me"
    },
    {
      "urdu": "مگر بات وہ کہوں کہوں گا جو اللہ اور اس کے رسول کو پسند ہوگی۔",
      "english": "But I will speak only that which pleases Allah and His Messenger"
    },
    {
      "urdu": "سبحان اللہ سبحان اللہ اب امام حطی بھی یہ ٹھہری کہ چونکہ اس وقت",
      "english": "Subhan Allah! Subhan Allah! Now another difficulty was that at that time"
    },
    {
      "urdu": "کوئی اتنا خاص میڈیا کا دور بھی نہیں تھا۔ کوئی تحریر تحریری سلسلہ بھی نہیں تھا۔",
      "english": "there was no special media era. There was no written tradition either"
    },
    {
      "urdu": "مگر جب تحریری سلسلہ شروع ہوا۔ تو وہ بھی خاطرخواہ اتنا نہیں تھا۔ کہ لوگوں کی پیاس",
      "english": "But when written documentation began, even that was not sufficient to quench people's thirst"
    },
    {
      "urdu": "بجھ سکے۔ اور جو یہ دکھ دکھ کی بات ہے اور سچی بات",
      "english": "And the sad truth is, and all friends will agree"
    },
    {
      "urdu": "ہے تسلیم کریں گے سارے دوست کہ جن لوگوں کا حق تھا میرے نزدیک خاطرخواہ انہوں نے",
      "english": "that those who had the right, in my opinion, did not fulfill their duty either. They kept working in their own way"
    },
    {
      "urdu": "بھی حق ادا نہیں کیا وہ بھی اپنے طور پر لگے رہے کام چلاتے رہے مگر الحمدللہ",
      "english": "But Alhamdulillah, Baba Ji Sahib Rahmatullah Alayhi, Lord of the Worlds"
    },
    {
      "urdu": "کہ بابا جی صاحب رحمتہ اللہ علیہ کتب العالمین حضور بابا جی پیر سید نور محمد",
      "english": "Hazoor Baba Ji Pir Syed Noor Muhammad Gilani Rahmatullah Alayhi's name was bright then, is bright now, and will remain bright until the morning of Judgment Day"
    },
    {
      "urdu": "گیلانی رحمۃ اللہ علیہ کا نام اس وقت بھی روشن تھا اب بھی روشن ہے قیامت کی صبح تک",
      "english": "Hazoor Qibla Alam Baba Ji Pir Haider Shah"
    },
    {
      "urdu": "روش حضور قبلہ عالم بابا جی پیر حیدر شاہ",
      "english": "known as Kali Chadar Wali Sarkar - they are asking about this personality who was a living example of his predecessors"
    },
    {
      "urdu": "المعروف کالی چادر والی سرکار یہ اس ہستی کے متعلق سوال کر رہے ہیں جو",
      "english": "known as Kali Chadar Wali Sarkar - they are asking about this personality who was a living example of his predecessors"
    },
    {
      "urdu": "ایک چلتا پھرتا اپنے اسلاف کا نمونہ سمجھ لیں",
      "english": "Consider him a picture of the pure Shariah"
    },
    {
      "urdu": "شریعت مطہرہ کی تصویر سمجھ لیں عشق مصطفی کا خزانہ سمجھ لیں",
      "english": "Consider him a treasure of love for Mustafa"
    },
    {
      "urdu": "سبحان اللہ جن کے لبوں پر ہمت",
      "english": "Subhan Allah! On whose lips always"
    },
    {
      "urdu": "یا تو قران کا سہارا یا مصطفی کریم کی زندگی کا درس ہوا کرتا تھا۔",
      "english": "either the support of Quran or the lesson of the life of Mustafa Kareem would be present"
    },
    {
      "urdu": "سبحان اللہ میں اگے چل کے عرض کروں گا",
      "english": "Subhan Allah! I will explain further ahead"
    },
    {
      "urdu": "چونکہ میڈیا کا دور نہیں تھا۔ یہ ایک لٹا پٹا قافلہ تھا۔ بغداد سے چلا۔ کہاں کہاں",
      "english": "Since there was no media era. This was a worn and weary caravan. It started from Baghdad. It stopped at various places"
    },
    {
      "urdu": "ٹھہرا۔ بخارا میں پہنچا۔ وہاں سے چلتا ہوا یہ لٹا پٹا قافلہ درس حق دیتا ہوا۔ قرم",
      "english": "It reached Bukhara. From there, moving forward, this worn caravan, giving lessons of truth, reached the Kurram Agency area of Tirah"
    },
    {
      "urdu": "ایجنسی علاقہ تیزی میں پہنچا وہاں قیام کیا وہاں سے پھر یہ قافلہ چلا",
      "english": "Stayed there, then this caravan moved again to North Waziristan, stopped at Akhan Kot"
    },
    {
      "urdu": "تیرا شمالی وریز وزیرستان میں ا کے ٹھہرا اخن کوٹ میں وہاں سے پھر یہ قافلہ چلا جو",
      "english": "From there, this caravan of three or two people moved on. One brother stayed in Tirah Sharif"
    },
    {
      "urdu": "تین دو ادمیوں پہ مشتمل تھا ایک بھائی تیرہ شریف میں رہ گئے چھوٹے بھائی جو تھے",
      "english": "The younger brother, there is a place on the Kohat to Bannu road called Darsamand"
    },
    {
      "urdu": "وہ کوہاٹ سے بنو روڈ کے اوپر ایک جگہ ہے دارسمن",
      "english": "Darsamand - this is a common invitation. They settled in Darsamand"
    },
    {
      "urdu": "کیا دارسمن دارسمند۔ یہ دعوت عام ہے۔ وہ",
      "english": "Their descendants are still there today. The Sadat Gilani of Darsamand are our paternal cousins"
    },
    {
      "urdu": "دارسمند ٹھہر گئے۔ اج بھی ان کی اولاد موجود ہے۔ جو دارسمند والے سادات گیلان",
      "english": "Subhan Allah! A single person, this caravan consisted of four people. First, in 1867 or 68, Chura Sharif was settled"
    },
    {
      "urdu": "ہیں وہ ہمارے چچیرے بھائی ہیں۔ سبحان اللہ۔",
      "english": "Subhan Allah! A single person, this caravan consisted of four people. First, in 1867 or 68, Chura Sharif was settled"
    },
    {
      "urdu": "ایک فرد چار ادمیوں پہ یہ قافلہ مشتمل پہلا۔ 1867 یا 68 میں 68 میں چورہ شفا کے۔",
      "english": "Camp was set up. Great difficulties and hardships were endured. But the word of truth was never abandoned"
    },
    {
      "urdu": "ڈیرا لگایا۔ بڑے صحبتیں بڑی تکلیفیں برداشت کیں۔ مگر",
      "english": "Camp was set up. Great difficulties and hardships were endured. But the word of truth was never abandoned"
    },
    {
      "urdu": "کلمہ حق جو ہے اسے نہیں چھوڑا سبحان اللہ",
      "english": "Subhan Allah!"
    },
    {
      "urdu": "دنیا کی جائیداد کی پرواہ نہیں کی کئی کئی سیکڑوں",
      "english": "They did not care for worldly property. Hundreds of"
    },
    {
      "urdu": "زمینیں مربع جات بڑی سنہری تشتریوں میں رکھ کے بھیجے گئے کہ صرف ایک کلمہ کہہ دیں",
      "english": "lands and estates were sent on golden trays saying just speak one word - accept our authority"
    },
    {
      "urdu": "کہ اپ اطاعت قبول کر لیں یہ اس وقت کی بات ہے جب موجودہ شورہ شریف کا ضلع اٹک جو ہے",
      "english": "This was at the time when the present district Attock of Chura Sharif did not exist"
    },
    {
      "urdu": "یہ ضلع اٹک اس وقت نہیں تھا اس وقت ضلع جو تھا وہ",
      "english": "At that time the district was headquartered at Shahpur"
    },
    {
      "urdu": "شاہپور پر صدر تھا یہ اس وقت کی بات ہے مگر کہا کہ نہیں یہ مربے یہ زمینیں",
      "english": "This was at that time. But they said no, these estates, these lands mean nothing to me compared to a single piece from the door of Mustafa"
    },
    {
      "urdu": "میرے سامنے کوئی حیثیت نہیں رکھتی جو مقام در مصطفی کے ایک ٹکڑے کا",
      "english": "Subhan Allah! As Ala Hazrat said - do not fall at the feet of strangers for their scraps"
    },
    {
      "urdu": "سبحان اللہ وہ اعلی حضرت نے کہا تھا نا کہ تیرے ٹکڑوں",
      "english": "Hazoor Qibla Ala Baba Ji, the story will be long. Pir Haider Shah Badshah, as we have heard - since there is no written record as I said"
    },
    {
      "urdu": "پہ پلے غیر کی ٹھوکر پہ نہ ڈال یہ سبق تھا حضور قبلہ اعلی بابا جی لمبی سی بات ہو",
      "english": "Hazoor Qibla Ala Baba Ji, the story will be long. Pir Haider Shah Badshah, as we have heard - since there is no written record as I said"
    },
    {
      "urdu": "جائے گی پیر حیدر شاہ بادشاہ جو ہم نے سنا کیونکہ تحریری معاملہ تو میں نے کہا نہیں",
      "english": "his birth was in Tirah Sharif. Subhan Allah! He was born in Tirah Sharif"
    },
    {
      "urdu": "ہے اپ کی پیدائش تیراہ شریف کی ہے سبحان اللہ",
      "english": "his birth was in Tirah Sharif. Subhan Allah! He was born in Tirah Sharif"
    },
    {
      "urdu": "تیراہ شریف میں پیدا ہوئے وہاں ہی اپ نے سلسلہ جو تھا مگر یہ دوسرے قافلے کے مسافر",
      "english": "The chain continued there but these are travelers of another caravan. The first caravan that settled Chura Sharif, they are not from that caravan"
    },
    {
      "urdu": "ہیں پہلا قافلہ جو چورہ شریف اباد ا چکا ہے اس قافلے کے یہ مسافر نہیں ہیں یہ",
      "english": "They are from the second or third caravan that culminated, they came to Darbar Chura Sharif in that caravan"
    },
    {
      "urdu": "دوسرے کے یا تیسرا قافلہ جو ہے جس کے اوپر انتہا ہوئی تھی قافلے کی یہ اس قافلے میں",
      "english": "This was the chain of his birth. Now, Allah knows the truth of what we have heard or seen and read"
    },
    {
      "urdu": "دربار چورہ شریف تشریف لائے تو یہ تھا ایک سلسلہ اپ کا جو اہ سلسلہ پیدائش کا تھا۔",
      "english": "This was the chain of his birth. Now, Allah knows the truth of what we have heard or seen and read"
    },
    {
      "urdu": "اب واللہ عالم بثواب جو ہم نے سنا ہے یا ہم نے دیکھا پڑھا ہے وہ یہی کہ اپ کا نام",
      "english": "Who proposed his name? Who gave him the title?"
    },
    {
      "urdu": "کس نے تجویز کیا؟ گڑتی تحلیف کس نے عطا فرمائی؟",
      "english": "Who proposed it? The title - who bestowed it?"
    },
    {
      "urdu": "سبحان اللہ۔ بزرگوں سے یہ سنا",
      "english": "Subhan Allah! We heard from the elders"
    },
    {
      "urdu": "کہ اپ کی پیدائش مبارک",
      "english": "that his blessed birth"
    },
    {
      "urdu": "تیرا شریف میں ہوئی۔ نام اپ کا جو تجویز ہوا یہ اپ کے",
      "english": "was in Tirah Sharif. The name that was proposed, it was by his grandfather"
    },
    {
      "urdu": "دادا گرامی حضرت بابا جی سید فقیر محمد رحمت اللہ",
      "english": "Hazrat Baba Ji Syed Faqir Muhammad Rahmatullah Alayhi who proposed it"
    },
    {
      "urdu": "علیہ نے تجویز فرمایا",
      "english": "He proposed the name"
    },
    {
      "urdu": "گڑتی تہنیف بھی حضرت نے اپنے ہاتھ سے عطا فرمائی",
      "english": "The first haircut was also given by Hazrat's own hands"
    },
    {
      "urdu": "سبحان اللہ گڑتی عطا فرما کے ہاتھ اٹھا کے یہ دعا",
      "english": "Subhan Allah! After giving the haircut, he raised his hands in prayer"
    },
    {
      "urdu": "مانگی کہ میرے مولا یہ جو مجھے تو نے ایک شہزادہ پوتے کی صورت",
      "english": "saying O my Lord, this prince grandson you have blessed me with, my Lord, I have named him Haider Shah"
    },
    {
      "urdu": "میں عطا فرمایا ہے میرے مولا میں نے اس کا نام حیدر شاہ رکھا ہے",
      "english": "I have connected his lineage to Maula Murtaza Haider Karrar"
    },
    {
      "urdu": "اس کی نسبت میں نے مولا مرتضی حیدر حیدر قرار سے کی ہے",
      "english": "Subhan Allah! My Lord, honor the name I have given"
    },
    {
      "urdu": "سبحان اللہ میرے مولا تو میرے اس نام رکھنے کی بھی",
      "english": "And I have also heard that those who were his peers, same age companions, he would tell them even in childhood"
    },
    {
      "urdu": "لاج رکھنا اور گرتی اس میری تحریف کی بھی لاج رکھنا اور یہ ان صفات کا حامل ہو جو",
      "english": "and honor my prayer, and may he possess those qualities that Sarkar Maula Murtaza Haider Karrar had. This was the chain of naming"
    },
    {
      "urdu": "سرکار مولا مرتضی حیدر قرار کی تھیں یہ تھا سلسلہ تحنیف کا اور نام رکھنے کا",
      "english": "Subhan Allah! Now about his childhood"
    },
    {
      "urdu": "سبحان اللہ کہ بچپن کے حالات",
      "english": "His brother who was an elder"
    },
    {
      "urdu": "اب جو اپ کے بھائی تھے بزرگ تھے",
      "english": "I heard from him just one or two things. First was that from childhood, as is the way of the Sufis"
    },
    {
      "urdu": "وہ ان سے سنا وہ صرف ایک بات یا دو باتیں جو میں نے سنی",
      "english": "I heard from him just one or two things. First was that from childhood, as is the way of the Sufis"
    },
    {
      "urdu": "تھیں کہ پہلی بات تو یہ کہ بچپن سے ہی جیسے ایک صوفیاء کا طریقہ ہے",
      "english": "from childhood there was a chain of piety"
    },
    {
      "urdu": "وہ بچپن سے ہی",
      "english": "there was a chain of God-consciousness"
    },
    {
      "urdu": "بڑے پرہیزگاری کا سلسلہ تھا،",
      "english": "staying away from frivolous talk or any sports and games of that time"
    },
    {
      "urdu": "تقوے کا سلسلہ تھا، لحب و لاب سے یا اس وقت جو کوئی کھیل کود",
      "english": "There was a practice of piety, from the cradle, and at that time whatever games and play"
    },
    {
      "urdu": "ہوتی تھی اس سے دور رہنا اور یہ بھی سنا ہے کہ جو اپ کے ہم اصر ہم",
      "english": "there were, he would stay away from them. And I've also heard that those who were his peers, his"
    },
    {
      "urdu": "عمر کچھ ساتھی تھے یہی ان کو فرماتے تھے بچپن میں بھی کہ بھائی ہم یہ کوئی کھیل",
      "english": "companions of the same age, he would tell them even in childhood, \"Brother, we shouldn't play these games\""
    },
    {
      "urdu": "کود کے لیے نہیں دنیا میں ائے ہیں کہ ہم کھیل کود میں اپنا وقت ضائع کر دیں ہم",
      "english": "that brother, we have not come to this world for play and games, to waste our time in games"
    },
    {
      "urdu": "کوئی دنیا میں کام کرنے کے لیے ائے ہیں سبحان اللہ سبحان اللہ",
      "english": "We have come to this world to do some work. Subhan Allah! Subhan Allah!"
    },
    {
      "urdu": "اور ہم نے دنیا میں کام کرنا ہے تو اپ کے جو لوگ ہم عمر تھے یہ سنا ہے کہ وہ کہتے",
      "english": "And we have to do work in this world. So I have heard that his peers would say"
    },
    {
      "urdu": "بھی کیا کام کرنا ہے بھئی کیا کام ہے بتاؤ کہتے ہیں کہ سب سے بڑا کام یہ ہے کہ الائے",
      "english": "what work do we have to do, brother, tell us. He would say the greatest work is that we have to spread the word of truth to the people"
    },
    {
      "urdu": "کلمہ حق ہم نے عوام تک پہنچانا ہے اور میرے ابا کی جو تعلیم",
      "english": "and my father's teachings - I have to spread them. Subhan Allah!"
    },
    {
      "urdu": "ہے اسے میں نے عام کرنا ہے سبحان اللہ",
      "english": "This is what I heard. Subhan Allah!"
    },
    {
      "urdu": "یہ ہیں بچپن کے حالات سلسلہ اب اور کیا ہے کیسے ہے یہ تو اب اللہ ہی بہتر جانتا ہے",
      "english": "These are the childhood circumstances. What else, how else - only Allah knows best"
    },
    {
      "urdu": "جو میں نے یہ دو باتیں سنی ہیں وہ میں نے عرض کردی کہ ابتدائی تعلیم",
      "english": "These two things I heard, I have presented. Where did he get his early education"
    },
    {
      "urdu": "کہاں حاصل کی اور اساتذہ میں کون",
      "english": "and who was among his teachers"
    },
    {
      "urdu": "شامل ہے جیسے کہ اج سے",
      "english": "Just like, from today, some time ago"
    },
    {
      "urdu": "کچھ عرصہ",
      "english": "before"
    },
    {
      "urdu": "پہلے",
      "english": "First"
    },
    {
      "urdu": "یہ ہمارے",
      "english": "this, in our"
    },
    {
      "urdu": "بزرگوں اسلاف کے گھروں میں یہ سلسلہ چلتا تھا کہ ابتدائی تعلیم جو تھی وہ اپنے",
      "english": "elders' and ancestors' homes, this tradition continued that early education was given at home"
    },
    {
      "urdu": "گھروں میں دی جاتی تھی وہ اس لیے دی جاتی تھی کیونکہ وہ دور جو",
      "english": "It was given at home because that era was such"
    },
    {
      "urdu": "تھا وہ ایسا تھا کہ گھروں میں جو علم کے موتی تقسیم ہوتے",
      "english": "that the pearls of knowledge distributed at home were very deep and precious"
    },
    {
      "urdu": "تھے وہ بڑے گہرے ناجاب ہوتے تھے اور تعلیم حاصل کرنے میں سے",
      "english": "And in obtaining education, Baba Ji Sarkar's elders, so early education was from his father"
    },
    {
      "urdu": "بابا جی سرکار کے بزرگ تو ابتدائی تعلیم اپنے",
      "english": "and his paternal uncle Hazoor who was a leading scholar of that time"
    },
    {
      "urdu": "والد گرامی اور اپنے تایا حضور",
      "english": "His respected father and his uncle Hazrat"
    },
    {
      "urdu": "جو وقت کے جید عالم تھے",
      "english": "a genius of his era, whose blessed name was Hazrat Baba Ji Muhammad Syed Muhammad Gul Nabi Shah Rahmatullah Alayhi"
    },
    {
      "urdu": "نابغیر روزگار تھے جن کا اسم گرامی حضرت بابا جی محمد سید محمد گل نبی شاہ رحمت",
      "english": "Subhan Allah!"
    },
    {
      "urdu": "اللہ علیہ سبحان اللہ",
      "english": "Allah bless him. Subhan Allah!"
    },
    {
      "urdu": "اپ کے تایا جان تھے وہی اس وقت سلسلہ تعلیم جو تھا وہ چلا رہے تھے اور پھر دادا",
      "english": "He was his paternal uncle who was running the chain of education at that time. Then there was grandfather's education too"
    },
    {
      "urdu": "جی صاحب کے اپ کے دادا جی حضرت بابا جی سید فقیر پیر محمد رحمۃ اللہ علیہ جو",
      "english": "His grandfather Hazrat Baba Ji Syed Faqir Pir Muhammad Rahmatullah Alayhi who was the elder brother"
    },
    {
      "urdu": "برادر اکبر تھے بڑے بھائی تھے ان کو افغانستان کی سرزمین سے ہندوستان کی",
      "english": "From the land of Afghanistan to the land of Hindustan, he was called Mulla Ji"
    },
    {
      "urdu": "سرزمین تک ان کو ملا جی کہا جاتا تھا چونکہ صرف یہ پاکستان اور ہندوستان کے",
      "english": "Since only in Pakistan and India, or perhaps Bangladesh, East Pakistan - this word Mufti is used"
    },
    {
      "urdu": "اندر یا شاید بنگلہ دیش کے اندر مشرقی پاکستان کے اندر مشرقی پاکستان کے اندر یہ",
      "english": "but in Afghanistan and other matters, the word Mulla was used. Mulla meant a person of piety, a person of knowledge"
    },
    {
      "urdu": "مفتی کا لفظ استعمال ہوتا ہے مگر یہ افغانستان کا معاملہ یا جو دوسرے معاملات",
      "english": "and one who has enough knowledge to give a fatwa. And Hazrat's great grandfather"
    },
    {
      "urdu": "ان میں لفظ ملا استعمال ہوتا تھا۔ ملا سے مراد ہوتی تھی صاحب تقوی صاحب علم اور جس",
      "english": "His blessed name was Hazrat Baba Ji Syed Deen Muhammad Shah Rahmatullah Alayhi, known as Hazrat Mulla Ji Sahib"
    },
    {
      "urdu": "کے پاس اتنا علم ہو کہ وہ فتوی دے سکے۔ اور حضرت کے دادا بزرگ جو تھے۔ اپ کا نام",
      "english": "His blessed name was Hazrat Baba Ji Syed Deen Muhammad Shah Rahmatullah Alayhi, known as Hazrat Mulla Ji Sahib"
    },
    {
      "urdu": "نامی تھا۔ حضرت بابا جی سید دین محمد شاہ رحمتہ اللہ علیہ۔ المعروف",
      "english": "I have also heard that some benefit was taken from him too, since they had established a proper school here at Chura Sharif"
    },
    {
      "urdu": "حضرات ملا جی صاحب۔ دنیا کیا کہ حضرات ملا جی صاحب",
      "english": "where their progeny and family members were taught. That was the chain of education at that time"
    },
    {
      "urdu": "ان سے بھی کچھ جو تک سنا ہے کہ استفادہ کیا چونکہ انہوں نے ا کے یہاں پہ چورہ",
      "english": "where their progeny and family members were taught. That was the chain of education at that time"
    },
    {
      "urdu": "شریف میں پراپر درسگاہ قائم کی تھی جس میں اپنی اپنی اولاد کو اپنے افراد کو وہ جو",
      "english": "what comes with it - Kali Chadar Wali Sarkar. I have heard"
    },
    {
      "urdu": "تھے اس وقت وہ درس تدبریس کا سلسلہ تھا اور تعلیم دی جاتی تھی بسم اللہ الرحمن",
      "english": "that his brothers who were his contemporaries at that time"
    },
    {
      "urdu": "الرحیم اب یہ سوال ہے کہ حضرت بابا جی پیر حیدر شاہ صاحب بادشاہ کے نام کے ساتھ اتا",
      "english": "in some gathering his elders, grandfather and uncle"
    },
    {
      "urdu": "ہے کالی چادر والی سرکار سنا ہے اپ کے جو اس وقت",
      "english": "mentioned something about the Prophet, the Pride of all Creation"
    },
    {
      "urdu": "بھائی تھے ہم اثر کہ کسی محفل میں",
      "english": "the Noble Master, the Beloved, peace be upon him, his blessed shawl"
    },
    {
      "urdu": "اپ کے بزرگوں نے دادا حضور نے تایا حضور نے",
      "english": "the black shawl, the black blanket. It settled so deeply in his heart"
    },
    {
      "urdu": "کوئی ذکر کیا حضور سرور کائنات فخر موجودات",
      "english": "the black shawl, the black blanket. It settled so deeply in his heart"
    },
    {
      "urdu": "اقا کریم حبیب علیہ الصلوۃ والسلام کی چادر مبارک",
      "english": "that from childhood to youth, from youth till the end, he took black cloth, made it into a shawl"
    },
    {
      "urdu": "کالی چادر کالی کملی تو وہ اتنا دل میں اتنا دل میں",
      "english": "and started keeping it not on the right but on the left shoulder, according to the Sunnah. Subhan Allah!"
    },
    {
      "urdu": "اتنا دل میں اس نے گھر کیا کہ اس وقت بچپن سے جوانی تک جوانی سے اخر",
      "english": "And when someone asked about this black shawl, Sarkar said my Master used a black blanket"
    },
    {
      "urdu": "تک کالا کپڑا لیا اس کی چادر بنائی اور وہ سیدھے نہیں الٹے کندھے کے اوپر سنت کے",
      "english": "so I say this is my Master's Sunnah. Subhan Allah!"
    },
    {
      "urdu": "مطابق مطابق رکھنی شروع کر دی۔ سبحان اللہ",
      "english": "And then that black shawl became such a part of life"
    },
    {
      "urdu": "اور جب کسی نے سوال کیا کہ یہ کالی چادر تو سرکار نے فرمایا کہ میرے اقا نے",
      "english": "that he became famous for it. In Chura Sharif, his brothers and elders"
    },
    {
      "urdu": "کالی کملی استعمال کی ہے تو میں کہتا ہوں کہ یہ میرے اقا کی سنت ہے۔",
      "english": "made him famous saying Haider Shah Kali Chadar Wali Sarkar"
    },
    {
      "urdu": "سبحان اللہ یہ بھی ادا ہوتی رہے۔",
      "english": "Subhan Allah! Subhan Allah! Even today in Chura Sharif if someone says Kali Chadar Wali Sarkar"
    },
    {
      "urdu": "سبحان اللہ اور وہ پھر اتنا زندگی کا حصہ بنا وہ جو",
      "english": "Subhan Allah! Subhan Allah! Even today in Chura Sharif if someone says Kali Chadar Wali Sarkar"
    },
    {
      "urdu": "کالی چادر تھی۔ کہ مشہوری ہی یہ ہو گئی چورہ شریف میں اپ کے جو بھائی تھے۔ بزرگ",
      "english": "that Kali Chadar Wali Sarkar means Hazrat Baba Ji Pir Haider Shah Sahib Rahmatullah Alayhi"
    },
    {
      "urdu": "تھے۔ انہوں نے کہ مشہور یہ کر دی کہ حیدر شاہ کالی چادر والی سرکار۔",
      "english": "This was the chain of the black shawl. Alhamdulillah"
    },
    {
      "urdu": "سبحان اللہ سبحان اللہ۔ وہ پھر اج تک چورہ شریف میں بھی اگر یہ",
      "english": "Now the word Badshah - there are two meanings. One is humorous - someone who is carefree, detached"
    },
    {
      "urdu": "کہا جائے کہ کالی چادر والی سرکار۔ تو وہ سمجھ جاتے ہیں سارے۔ ہمارے خاندان کے",
      "english": "is called Badshah. Another meaning is when someone has kingly qualities, they are called Badshah"
    },
    {
      "urdu": "نوجوان میرے بھائی بزرگ اب بھی سمجھ جاتے ہیں کہ اس سے مراد کالی چادر والی سرکار",
      "english": "is called Badshah. Another meaning is when someone has kingly qualities, they are called Badshah"
    },
    {
      "urdu": "سے حضرت بابا جی پیر حیدر شاہ صاحب رحمتہ اللہ علیہ ہیں۔ یہ تھا ایک سلسلہ کالی",
      "english": "Now his state of indifference was such"
    },
    {
      "urdu": "چادر کا۔ الحمدللہ یہ سلسلہ بھی کوئی بادشاہی سے مراد جو ہے",
      "english": "Now his state of indifference was such"
    },
    {
      "urdu": "وہ دو طریقے ہوتے ہیں ایک تو مزاحیہ طریقہ ہے کوئی لاپرواہ ہو بے نیاز ہو تو اسے",
      "english": "and his state of absorption was such, his closeness to Allah and the Prophet was such that whoever came, big or small, sat down, left, greetings were exchanged, well-being was asked, and that was all"
    },
    {
      "urdu": "بادشاہ کہتے ہیں ایک کے اندر وہ شہانہ صفات ہوں تو اس کو بادشاہ کہتے ہیں",
      "english": "and his state of absorption was such, his closeness to Allah and the Prophet was such that whoever came, big or small, sat down, left, greetings were exchanged, well-being was asked, and that was all"
    },
    {
      "urdu": "اب بے پرواہی کا یہ عالم تھا",
      "english": "and his state of absorption was such, his closeness to Allah and the Prophet was such that whoever came, big or small, sat down, left, greetings were exchanged, well-being was asked, and that was all"
    },
    {
      "urdu": "اور استغرا کی یہ حالت تھی قرب خداوندی اور قرب رسول کا یہ حال تھا کہ کوئی بھی",
      "english": "After that, his royal demeanor was such that"
    },
    {
      "urdu": "بڑے سے بڑا ایا بیٹھ گیا چلا گیا سلام دعا ہوئی خیر و عافیت پوچھی اور بس",
      "english": "he wore very fine clothing his entire life. He used elegant attire"
    },
    {
      "urdu": "اس کے بعد شاہانہ ٹھاٹ باٹ کا یہ عالم تھا کہ",
      "english": "He used a beautiful waistcoat. So this relationship was also bestowed from his family"
    },
    {
      "urdu": "نہایت نفیس لباس نفیس لباس ساری زندگی زیب تن کیا تابند جو",
      "english": "His elders would say this son of ours is a king. Subhan Allah!"
    },
    {
      "urdu": "تھا وہ استعمال کیا کرتا استعمال کیا ویس کوٹ استعمال کی بڑا خوبصورت اسا استعمال",
      "english": "He is a king. Subhan Allah!"
    },
    {
      "urdu": "کیا تو یہ نسبت جو تھی یہ بھی اپنے خاندان سے",
      "english": "Haider Shah Badshah - this word was used. But in the world of Sufism"
    },
    {
      "urdu": "عطا ہوئی کہ اپ کے بزرگ جو تھے وہ فرماتے تھے کہ یہ بیٹا ہمارا جو ہے یہ تو بادشاہ",
      "english": "those who were his contemporaries, I don't know about them. But I will note the reference of Kasur"
    },
    {
      "urdu": "ہے سبحان اللہ",
      "english": "those who were his contemporaries, I don't know about them. But I will note the reference of Kasur"
    },
    {
      "urdu": "بادشاہ ہے سبحان اللہ",
      "english": "those who were his contemporaries, I don't know about them. But I will note the reference of Kasur"
    },
    {
      "urdu": "تو اس سلسلے میں یہ یہ جو عطا ہوا تھا یہ سب لقب سمجھ لیں یا کوئی اعزاز سمجھ لیں",
      "english": "Many people in England are witnesses to this. In Kasur there was a great saint of the Chishti order"
    },
    {
      "urdu": "جیسے بھی سمجھیں اسے کہ حیدر شاہ بادشاہ کا جو لفظ ہے وہ استعمال ہوا مگر تصوف کی",
      "english": "Hazrat Baba Ji Pir Syed Naqeeb Ullah Shah Sahib Rahmatullah Alayhi"
    },
    {
      "urdu": "دنیا میں جو اس وقت اپ کے ہمسر لوگ تھے ان میں سے تو مجھے پتہ نہیں ہے ہم اصل کا تو",
      "english": "A reliable companion told me this"
    },
    {
      "urdu": "مجھے پتہ نہیں ہے مگر سرزمین قصور کا میں حوالہ ضرور نوٹ کروں گا انگلینڈ میں کافی",
      "english": "that in his gathering, there was mention of Hazoor Baba Ji Qibla Alam Pir Syed Naqeeb Ullah Shah Sahib"
    },
    {
      "urdu": "لوگ اس کے وٹنس ہیں گواہ ہیں قصور کے اندر ایک بزرگ ہوئے ہیں سلسلہ چشتیہ کے حضرت",
      "english": "He was a great Sufi, a great scholar, not ordinary at all. He was a high-ranking"
    },
    {
      "urdu": "بابا جی پیر سید سید نقیب اللہ شاہ صاحب رحمتہ اللہ علیہ",
      "english": "scholar and at that time, the sign of a Pir was that they were great scholars. Subhan Allah!"
    },
    {
      "urdu": "کسی مجھے ساتھی نے مستند ساتھی نے یہ بات بتائی",
      "english": "Subhan Allah!"
    },
    {
      "urdu": "کہ اپ کی محفل میں ذکر ہوا پیر حضور بابا جی قبلہ عالم پیر سید نقیب اللہ شاہ صاحب",
      "english": "Among them was Hazrat Baba Ji Sayyidna Naqeeb Ullah Shah Sahib, a perfect Sufi"
    },
    {
      "urdu": "بڑے پائے کے صوفی تھے بڑے پائے کے عالم تھے کوئی معمولی نہیں تھے وہ بڑے پائے کے",
      "english": "When his gathering started discussing leisurely, he paid attention and asked whose mention is this"
    },
    {
      "urdu": "عالم تھے اور اس وقت تو پیر کی پہچان یہی ہوتی تھی نا کہ وہ بڑے پائے کے عالم ہوتے",
      "english": "A servant said it's about Chura Sharif. Then in a state of spiritual ecstasy, friends who were his servants here tell us"
    },
    {
      "urdu": "تھے سبحان اللہ",
      "english": "A servant said it's about Chura Sharif. Then in a state of spiritual ecstasy, friends who were his servants here tell us"
    },
    {
      "urdu": "ان میں حضرت بابا جی سیدنا نقیب اللہ شاہ صاحب صاحب اور بڑے کامل صوفی",
      "english": "that in a strange spiritual state, he said the one you are mentioning, Pir Haider Shah Sahib - he was a king of spiritual path"
    },
    {
      "urdu": "ان کی جب محفل میں ذکر ہوا ارام ارام سے تو توجہ کی اور پوچھا کہ کس کا ذکر ہو رہا",
      "english": "that in a strange spiritual state, he said the one you are mentioning, Pir Haider Shah Sahib - he was a king of spiritual path"
    },
    {
      "urdu": "ہے تو کسی خادم نے کہا جی یہ چورہ شریف کا ذکر ہو رہا ہے۔ تو بڑی حالت وجدانی میں",
      "english": "Subhan Allah!"
    },
    {
      "urdu": "دوست بتاتے ہیں ان کے خادم جو یہاں پہ ہیں بتاتے ہیں۔ کہ بڑی عجیب وجدانی کیفیت میں",
      "english": "and those after him, the people of Sufism, people of insight, they would acknowledge that he wanted the spiritual path"
    },
    {
      "urdu": "اپ نے فرمایا کہ جن کا اپ ذکر کر رہے پیر حیدر شاہ صاحب کا وہ طریقت کے بادشاہ",
      "english": "In the name of Allah. This is a tradition that comes in our family, and is in most families"
    },
    {
      "urdu": "تھے۔ سبحان اللہ",
      "english": "that the family's pledge is within the family. Now whose hand is the pledge on? A person of wisdom understands"
    },
    {
      "urdu": "وہ طریقت کا بادشاہ تھا۔ کوئی معمولی بات نہیں ہے۔ تو یہ بھی ہوا نا کہ اپنے ہمسر",
      "english": "that the family's pledge is within the family. Now whose hand is the pledge on? A person of wisdom understands"
    },
    {
      "urdu": "اور ہمسوں کے بعد بھی یہ لوگ جو ہیں اہل تصوف، اہل نظر یہ اس بات کا اعتراف کرتے",
      "english": "Like my sons, their pledge is to their paternal grandfather's younger brother Hazrat Baba Ji Pir Muhammad Ali Shah Sarkar's blessed hand"
    },
    {
      "urdu": "تھے کہ وہ طریقت کے بعد چاہتے تھے۔ بسم اللہ الرحمن الرحیم۔ یہ ہمارے خاندان",
      "english": "Like my sons, their pledge is to their paternal grandfather's younger brother Hazrat Baba Ji Pir Muhammad Ali Shah Sarkar's blessed hand"
    },
    {
      "urdu": "کی ایک روایت چلی اتی ہے اور اکثر خاندانوں میں ہے کہ خاندان کی بیعت خاندان",
      "english": "The youngest wasn't there at that time, but Usman Shah, Fazl Usman Shah, Fazl Noman Shah's pledge is on his hand"
    },
    {
      "urdu": "میں ہی ہوتی ہے۔ اب خاندان میں کس کے ہاتھ پہ ہوتی ہے؟ صاحب عقل سمجھ اتا ہے۔ جیسے",
      "english": "In this way, this chain continues till today. Pledges also happen outside, like my nephews - may Allah grant them safety"
    },
    {
      "urdu": "یہ جو میرے بیٹے ہیں ان کی بیعت جو ہے وہ اپنے حقیقی دادا کے چھوٹے بھائی حضرت بابا",
      "english": "In this way, this chain continues till today. Pledges also happen outside, like my nephews - may Allah grant them safety"
    },
    {
      "urdu": "جی پیر محمد علی شاہ سرکار کے دست حق پرست پہ ہے۔ دونوں تینوں",
      "english": "Yes, Pir Muhammad Ali Shah Sarkar - it is upon his blessed truth-seeking hand. Both, all three"
    },
    {
      "urdu": "کی چھوٹا تو اس وقت تھا نہیں مگر عثمان شاہ",
      "english": "Both or three nephews' pledge is to Hazrat Baba Ji Sarkar Sirhindi Sarkar, probably Muhammad Masum - not Sarhad, Madani"
    },
    {
      "urdu": "فضل فضل عثمان شاہ یہ فضل نعمان شاہ کی بیعت جو ان کے ہاتھ پہ ہے اسی طریقے سے یہ",
      "english": "Both or three nephews' pledge is to Hazrat Baba Ji Sarkar Sirhindi Sarkar, probably Muhammad Masum - not Sarhad, Madani"
    },
    {
      "urdu": "سلسلہ جو ہے اج تک جاری ہے کہ باہر بھی بیعت ہوتی ہے جیسے میرے بھتیجے ہیں اللہ",
      "english": "there are other young men of ours whose pledges are outside. But Alhamdulillah, in the Mujaddidiyya and Naqshbandiyya order"
    },
    {
      "urdu": "تعالی سلامتی عطا فرمائے دونوں تینوں بھتیجوں کی بیعت جو ہے وہ حضرت بابا جی",
      "english": "as I have come to know from somewhere that some youth had an inclination towards Hazrat Sarkar Baba Ji Muhammad Fazl Usman Jan Sirhindi"
    },
    {
      "urdu": "سرکار سرہندی سرکار غالبا محمد معصوم سرحد نہیں",
      "english": "their eagerness was towards him. Similarly, Hazrat Baba Ji Sarkar Syed Haider Shah Badshah, Kali Chadar Wali Sarkar's pledge"
    },
    {
      "urdu": "مدنی مدینہ منورہ میں اپ تھے دونوں کی بیعت جو ہے وہ اپ کے ہاتھ پہ ہے اسی طریقے",
      "english": "was on his grandfather's hand, whom the world of Sufism knows as Hazrat Baba Ji Syed Faqir Muhammad Rahmatullah Alayhi"
    },
    {
      "urdu": "سے اور بھی ہمارے صاحبزادگان ہیں جن کی بیعت جو ہے وہ باہر ہے مگر الحمدللہ ہے وہ",
      "english": "Subhan Allah! The Khilafats (spiritual successions) he had - he had two Khilafats"
    },
    {
      "urdu": "سلسلہ مجددیہ اور نقشبندیہ کے اندر جس طریقے سے مجھے کہیں سے پتہ چلا ہے کہ کچھ",
      "english": "One Khilafat was bestowed from his grandfather, and the second Khilafat was from his father"
    },
    {
      "urdu": "نوجوان جو ہیں ان کی رغبت جو تھی وہ حضرت سرکار بابا جی محمد فضل عثمان جان سرہندی",
      "english": "Hazrat Baba Ji Syed Ahmad Nabi, known as Zulfan Wali Sarkar"
    },
    {
      "urdu": "کی ترشی ان کا رجوع تھا۔ اسی طریقے سے حضرت بابا جی سرکار سید حیدر شاہ بادشاہ",
      "english": "Subhan Allah!"
    },
    {
      "urdu": "کالی چادر والو سرکار کی بیعت جو تھی وہ اپنے دادا کے ہاتھ پہ تھی جن کو دنیا",
      "english": "In 64, at that time I was studying at Dar ul Uloom Jamia Naeemia. But from Chura Sharif at that time"
    },
    {
      "urdu": "کائنات دنیا تصوف حضرت بابا جی سید فقیر محمد رحمت اللہ علیہ کے نام سے",
      "english": "In 64, at that time I was studying at Dar ul Uloom Jamia Naeemia. But from Chura Sharif at that time"
    },
    {
      "urdu": "سبحان اللہ خلافتیں جو تھیں وہ اپ کے پاس دو خلافتیں",
      "english": "In 64, at that time I was studying at Dar ul Uloom Jamia Naeemia. But from Chura Sharif at that time"
    },
    {
      "urdu": "تھیں ایک خلافت اپنے دادا سے عطا ہوئی تھی اور اس کے بعد دوسری خلافت جو تھی وہ اپنے",
      "english": "In 64, at that time I was studying at Dar ul Uloom Jamia Naeemia. But from Chura Sharif at that time"
    },
    {
      "urdu": "والد گرامی حضرت بابا جی سید احمد نبی المعروف زلفاں والی سرکار سے عطا ہوئی تھی",
      "english": "Respected father Hazrat Baba Ji Syed Ahmad Nabi, known as Zulfan Wali Sarkar, bestowed it"
    },
    {
      "urdu": "جس کا اپ بڑے محبت سے تذکرہ فرماتے تھے کہ میں نے دو بادشاہوں کی خدمت کی ہے اور دو",
      "english": "which he would mention with great affection: \"I have served two kings and two"
    },
    {
      "urdu": "شہنشاہوں سے میں نے یہ سلسلہ قید حاصل کیا ہے",
      "english": "his spiritual retreat was at Dhok Mithi Sharif. I would present myself in his service whenever I was free"
    },
    {
      "urdu": "سبحان اللہ ماشاءاللہ یہ بڑا ایک حسین سوال ہے چونکہ",
      "english": "his spiritual retreat was at Dhok Mithi Sharif. I would present myself in his service whenever I was free"
    },
    {
      "urdu": "حضرت کا وصال جو ہوا ہے وہ 64 میں ہوا ہے 64",
      "english": "This was before going to Lahore and after. During my student days, it was my good fortune that Sarkar asked"
    },
    {
      "urdu": "میں اس وقت دارالعلوم جامعہ نعیمیہ میں زیر تعلیم",
      "english": "what do you do, where are you? I submitted that Sarkar, I am in Lahore. What do you do? I said I study"
    },
    {
      "urdu": "مگر چورہ شریف سے اس وقت اپ کی جو چلہ گاز جو ذکر ائے گا ڈھوک مٹھی شریف کے اوپر اپ",
      "english": "Where do you study? What do you study? I said Dar ul Uloom Jamia Naeemia. He said I know, I know Mufti Muhammad Hussain Naeemi Sahib"
    },
    {
      "urdu": "جلوہ فرما میں جب بھی فارغ ہوتا یہ لاہور جانے سے",
      "english": "I said he is among our teachers. He teaches and there are other teaching faculty too"
    },
    {
      "urdu": "پہلے کی بات ہے اور بعد کی بھی کہ میں مٹھین شریف اپ کی خدمت میں حاضر ہوتا تھا",
      "english": "After a silence, he told me that sometimes take out time and visit Data Ganj Bakhsh Ali Hujwiri. Subhan Allah!"
    },
    {
      "urdu": "تعلیمی دور میں یہ میری خوش نصیبی ہے کہ اپ سرکار نے پوچھا بھئی کیا کرتے ہو؟ کہاں",
      "english": "After a silence, he told me that sometimes take out time and visit Data Ganj Bakhsh Ali Hujwiri. Subhan Allah!"
    },
    {
      "urdu": "ہوتے ہو؟ تو میں نے عرض کی کہ سرکار میں لاہور ہوتا ہوں۔ کیا کرتے ہو؟ میں نے کہا",
      "english": "After a silence, he told me that sometimes take out time and visit Data Ganj Bakhsh Ali Hujwiri. Subhan Allah!"
    },
    {
      "urdu": "جی پڑھتا ہوں۔ کہاں پڑھتے ہو؟ کیا پڑھتے ہو؟ میں نے کہا جی دارالعلوم جامعہ نعیمیہ",
      "english": "Don't be proud of sitting at the head, sit at the feet. Subhan Allah!"
    },
    {
      "urdu": "ہے۔ اپ فرماتے ہیں مجھے پتہ ہے مفتی محمد حسین نعیمی صاحب میں واقف ہوں۔ میں نے کہا",
      "english": "Don't be proud of sitting at the head, sit at the feet. Subhan Allah!"
    },
    {
      "urdu": "جی وہ میرے ہمارے استاد اساتذہ میں سے ہیں۔ ان کا درس ہے اور پڑھانے والے اساتذہ",
      "english": "And after finishing there, sometimes also visit Allama Iqbal, the Qalandar of Lahore. He will also give you something"
    },
    {
      "urdu": "اور ہیں۔ خاموشی کے بعد اپ نے مجھے فرمایا کہ کبھی کبھی وقت نکال کے سرکار داتا گنج",
      "english": "Subhan Allah! This was one chain. Then I started going. There's a tradition in Lahore"
    },
    {
      "urdu": "بخش علی ہجویری کے پاس جایا کرو سبحان اللہ",
      "english": "that on Thursdays we must go to Data Sahib, and while passing, we visit Allama Iqbal Rahmatullah Alayhi"
    },
    {
      "urdu": "سرہانے بیٹھنے کی بڑائی نہ کرنا قدموں میں بیٹھا کرو",
      "english": "The term Lahori Qalandar was used by Baba Ji Pir Haider Shah Rahmatullah Alayhi first. If anyone else claims it, I have no concern"
    },
    {
      "urdu": "سبحان اللہ اور وہاں سے فارغ ہو کے کبھی کبھی لاہوری",
      "english": "Then I would go there. Now let me tell you something interesting"
    },
    {
      "urdu": "قلندر علامہ اقبال کے پاس بھی جایا کرو وہ بھی اپ کو کچھ دیں گے",
      "english": "Two miracles of Allama Iqbal Sahib I will mention that I have seen practically, not just heard"
    },
    {
      "urdu": "سبحان اللہ یہ ایک تو یہی سلسلہ تھا اب میں نے جانا",
      "english": "The first was in 60... or 66"
    },
    {
      "urdu": "جانا شروع کر دیا ہمارے لاہور کی ایک روایت ہے کہ جمعرات کو ہم لاہور کے لازمی",
      "english": "I was traveling from Daska and was on a bus. On the way there is a beautiful turn called Nandipur where there's a power station"
    },
    {
      "urdu": "داتا صاحب جاتے ہیں اور گائے بگائے میں علامہ اقبال رحمتہ اللہ علیہ لاہوری قلندر",
      "english": "I was traveling from Daska and was on a bus. On the way there is a beautiful turn called Nandipur where there's a power station"
    },
    {
      "urdu": "کا لفظ جو ہے یہ بابا جی پیر حیدر شاہ نے استعمال کیا ہے رحمتہ اللہ علیہ نے سب سے",
      "english": "I was traveling from Daska and was on a bus. On the way there is a beautiful turn called Nandipur where there's a power station"
    },
    {
      "urdu": "پہلے اب کوئی کہتا پھرے تو کوئی کہے مجھے اس سے کوئی سروکار نہیں ہے",
      "english": "When we reached there, a cool breeze blew. It was summer season. A thought came to my mind"
    },
    {
      "urdu": "تو وہاں جاتا اب یہ مزے کی بات اپ کو ایک بتاؤں یہ علامہ اقبال صاحب کی دو کرامات",
      "english": "that I have such love and devotion for Allama Iqbal Rahmatullah Alayhi but he has never guided me till today"
    },
    {
      "urdu": "میں کہوں گا جو پریکٹیکل میں نے دیکھی ہیں یہ نہیں ہے",
      "english": "that I have such love and devotion for Allama Iqbal Rahmatullah Alayhi but he has never guided me till today"
    },
    {
      "urdu": "کہ میں نے سنی ہے پہلی یہ کہ 60 فا یا 66 کی بات ہے کہ میں ڈسکا سے سفر کر",
      "english": "I thought just this and my eyes closed. When I dozed off, I saw Allama Sahib standing next to me in the bus"
    },
    {
      "urdu": "رہا تھا اور میں بس میں تھا راستے میں ایک بڑا خوبصورت ایک ٹرن ہے",
      "english": "I had a book in my hand, it was a student custom then. Whatever was liked was written down"
    },
    {
      "urdu": "نندی پور اسے کہتے ہیں وہاں پہ بجلی گھر ہے",
      "english": "Many verses were written on vehicles that were liked. There was always a pen with me"
    },
    {
      "urdu": "وہاں پہ جب ایا تو ٹھنڈی ٹھنڈی ٹھنڈی ہوا لگی گرمی کا موسم تھا تو میرے ذہن میں",
      "english": "Then Allama Rahmatullah Alayhi, Lahori Qalandar, said you have complained, so write now. What did he make me write?"
    },
    {
      "urdu": "خیال ایا بھئی میں اتنی ایک محبت اور عقیدت رکھتا ہوں علامہ اقبال رحمتہ اللہ",
      "english": "Then Allama Rahmatullah Alayhi, Lahori Qalandar, said you have complained, so write now. What did he make me write?"
    },
    {
      "urdu": "علیہ کے ساتھ مگر انہوں نے اج تک کوئی میری رہنمائی نہیں کی",
      "english": "He ordered me to write: This lesson I have learned from Lahori Qalandar. Subhan Allah!"
    },
    {
      "urdu": "یہ اتنا میں نے سوچا اور میری انکھ لگ گئی جب انکھ لگی تو میں کیا دیکھتا ہوں کہ",
      "english": "This lesson I have learned from Lahori Qalandar - Being a beggar of Mustafa is better than being Alexander of the world"
    },
    {
      "urdu": "علامہ صاحب بس میں میرے پاس کھڑے ہیں سبحان اللہ سبحان اللہ",
      "english": "Subhan Allah!"
    },
    {
      "urdu": "اپ مجھے کندھے پہ ہاتھ رکھ کے کہتے ہیں بھی اپ نے شکوہ کیا ہے تو اپ یہ کاپی",
      "english": "After that, since Hazrat had instructed to keep visiting Allama Iqbal"
    },
    {
      "urdu": "کھولے میرے ہاتھ میں ایک بک ہوتی تھی اس وقت کچھ طالب علمی کا رواج بھی تھا سلسلہ",
      "english": "they will give you something from there. Then once I complained that there are only two or three Naats explicitly titled in your work"
    },
    {
      "urdu": "تھا جو چیز پسند ائی وہ لکھ لی استاد بھی یہی کہتے تھے اور کوئی ضروری نہیں ہے جو",
      "english": "You haven't written a Naat with a specific title. So in a dream, Hazrat Allama Lahori Qalandar told me"
    },
    {
      "urdu": "بھی پسند ائی اس میں کئی ڈھولے بھائیے بھی تھے جو پسند تھے وہ لکھ لیے گاڑیوں میں",
      "english": "You haven't written a Naat with a specific title. So in a dream, Hazrat Allama Lahori Qalandar told me"
    },
    {
      "urdu": "کئی شعر لکھے ہوتے تھے جو پسند ہے وہ لکھ لیے یعنی وہ قلم کا ساتھ ہوتی تھی تو",
      "english": "that I have written one Naat which has not been destroyed but is lying in my library. The first verse of that Naat is:"
    },
    {
      "urdu": "علامہ رحمۃ اللہ علیہ لاہوری قلندر فرماتے ہیں کہ اپ نے شکوہ کیا ہے تو لکھ لو اب",
      "english": "The eye of the lover perceives the semi-veil. No matter how much he hides his face in Taiba"
    },
    {
      "urdu": "انہوں نے مجھے کیا لکھایا انہوں نے مجھے حکم دیا کہ لکھو کہ یہ سبق",
      "english": "hiding it a thousand times. Now regarding training, I would often reach Hazrat's service"
    },
    {
      "urdu": "سیکھا ہے میں نے لاہوری قلندر سے سبحان اللہ",
      "english": "From there, book learning was less but practical learning was abundant. Subhan Allah!"
    },
    {
      "urdu": "یہ سبق سیکھا ہے میں نے لاہوری قلندر سے گدائے مصطفی بہتر ہے دنیا کے سکندر سے",
      "english": "From there, book learning was less but practical learning was abundant. Subhan Allah!"
    },
    {
      "urdu": "سبحان اللہ اللہ یہ اپ نے مجھے نوٹ کرایا میں نے نوٹ",
      "english": "Subhan Allah! Allah! You made me note this down, I noted"
    },
    {
      "urdu": "کر لیا اور جب میں نے نا وہ جھٹکا لگا بس کا دیکھا تو وہ لکھا ہوا تھا مگر حضرت",
      "english": "What was practical learning? Like, I won't attribute this to him, but Azam Lahori has a verse in his Naat"
    },
    {
      "urdu": "نہیں تھے سبحان اللہ",
      "english": "What was practical learning? Like, I won't attribute this to him, but Azam Lahori has a verse in his Naat"
    },
    {
      "urdu": "اس کے بعد پھر چونکہ حضرت کا فرمان تھا بھئی علامہ اقبال کے پاس جایا ایا کرو",
      "english": "What was practical learning? Like, I won't attribute this to him, but Azam Lahori has a verse in his Naat"
    },
    {
      "urdu": "وہاں سے وہ کچھ تمہیں کچھ دیں گے پھر ایک دفعہ میں نے شکوہ کیا بھئی از قسم نعت دو",
      "english": "He sits on a mat but is enthroned on the heavens. From there practically, I learned a lesson"
    },
    {
      "urdu": "تین ہی اپ کے کلام میں ملتی ہیں کوئی عنوان کے ساتھ نعت اپ نے نہیں لکھی",
      "english": "Not boast. Practically, this is what was learned there. And as for training, Alhamdulillah whatever is there, it is the blessing of Sarkar's gaze"
    },
    {
      "urdu": "تو عالم رویا میں حضرت علامہ لاہوری قلندر نے مجھے فرمایا کہ ایک نعت میں نے لکھی ہے",
      "english": "Subhan Allah! Beautiful moments - each and every moment was beautiful, more beautiful. But in my conscious life"
    },
    {
      "urdu": "جو تباہ نہیں ہوئی مگر وہ میرے کتب خانے میں پڑی ہوئی ہے اس نعت کا پہلا شعر ہے کہ",
      "english": "Subhan Allah! Beautiful moments - each and every moment was beautiful, more beautiful. But in my conscious life"
    },
    {
      "urdu": "نگاہ عاشق کی تاڑ لیتی ہے پردہ نیم کو اٹھا اٹھا کر وہ لاکھ طیبہ میں جا کے",
      "english": "there are many beautiful moments. That time was also beautiful. Today I recall that mats are spread"
    },
    {
      "urdu": "بیٹھے ہزار منہ کو چھپا چھپا کر اب یہ ہے کہ تربیت کا معاملہ تو میں اکثر",
      "english": "and the king of Chura Sharif is seated. Subhan Allah! Hazoor Baba Ji is present"
    },
    {
      "urdu": "حضرت کی خدمت میں پہنچ جاتا تھا وہاں سے کتاب کی تعلیم کم ملتی تھی عملی تعلیم جو",
      "english": "My respected father is present. Hazoor Qibla Chacha Ji (paternal uncle) is present. Grandfather's younger brother"
    },
    {
      "urdu": "تھی وہ بہت زیادہ ملتی تھی سبحان اللہ",
      "english": "My respected father is present. Hazoor Qibla Chacha Ji (paternal uncle) is present. Grandfather's younger brother"
    },
    {
      "urdu": "عملی تعلیم کیا تھی کہ جیسے ہے نا وہ اپ سے تو میں یہ منسوب نہیں کر رہا اعظم",
      "english": "Hazoor Qibla Pir Mahboob Shah Sahib is present. And his maternal cousin, grandfather who was a great leading scholar of his time"
    },
    {
      "urdu": "لاہوری کا ایک نعت کا شعر ہے کہ بیٹھا ہے چٹائی پہ مگر عرش نشیں ہے",
      "english": "a very great leading scholar. His blessed name was Hazoor Qibla Alam Baba Ji Pir Syed Maulana Saeed Ahmad Shah Sahib Rahmatullah Alayhi"
    },
    {
      "urdu": "اب وہاں سے پریکٹیکلی ایک تعلیم ملتی تھی وہ پریکٹیکلی تعلیم کیا تھی کہ سب کچھ",
      "english": "who was a maternal cousin, is seated. And then others including his other maternal cousins"
    },
    {
      "urdu": "ہونے کے باوجود بھی اپنے اپ کو خاکساری میں رکھنا ہے انکساری میں رکھنا ہے ڈینگیں",
      "english": "Hazrat Baba Ji Pir Syed Muhammad Shafi Rahmatullah Alayhi. And they are"
    },
    {
      "urdu": "نہیں مارنی پریکٹیکلی طور پہ وہاں پہ یہ کچھ ملتا تھا اور جہاں تک تربیت کا تعلق",
      "english": "Hazrat Baba Ji Pir Syed Muhammad Shafi Rahmatullah Alayhi. And they are"
    },
    {
      "urdu": "ہے وہ الحمدللہ جو کچھ بھی ہے یہ سرکار کی نگاہ کا صدقہ ہے",
      "english": "Hazrat Baba Ji Pir Syed Muhammad Shafi Rahmatullah Alayhi. And they are"
    },
    {
      "urdu": "سبحان اللہ حسین لمحات تو ایک ایک لمحہ جو تھا وہ حسین حسین تر تھا مگر جو سن شعور",
      "english": "Subhan Allah! Beautiful moments - each moment was beautiful, more beautiful, but from the age of awareness"
    },
    {
      "urdu": "کی میری زندگی ہے اس میں بڑے بڑے حسین لمحات وہ وقت بھی بڑا حسین اج بھی میں یاد",
      "english": "in my life, there were many beautiful moments. That time was also very beautiful - even today I remember"
    },
    {
      "urdu": "کرتا ہوں کہ چٹائیاں بچھی ہوئی ہیں اور چور شریف کے بادشاہ بیٹھے ہوئے ہیں",
      "english": "that mats were spread and the kings of Chura Sharif were seated"
    },
    {
      "urdu": "سبحان اللہ حضور بابا جی جلوہ فرما ہیں قبلہ والد",
      "english": "Subhan Allah! Hazrat Baba Ji was seated in his glory, respected father"
    },
    {
      "urdu": "گرامی تشریف فرما ہیں حضور قبلہ چاچا جی محترم تشریف فرما ہیں دادا جی کے بھائی",
      "english": "was present, respected uncle Ji was present, grandfather's brother"
    },
    {
      "urdu": "چھوٹے حضور قبلہ پیر محبوب شاہ صاحب جلوہ فرما ہیں اور اپ کے خالہ زاد بھائی دادا",
      "english": "the younger one, Hazrat Pir Mahboob Shah Sahib was seated, and your maternal cousin, grandfather"
    },
    {
      "urdu": "جی جو اپنے وقت کے بہت بڑے جید عالم تھے بہت بڑے جید عالم تھے ان کا نام نامی تھا",
      "english": "who was a very great distinguished scholar of his time, a very great distinguished scholar, his blessed name was"
    },
    {
      "urdu": "حضور قبلہ عالم بابا جی پیر سید مولانا سعید احمد شاہ صاحب رحمت اللہ علیہ جو",
      "english": "Hazrat Alim Baba Ji Pir Syed Maulana Saeed Ahmad Shah Sahib, may Allah's mercy be upon him, who"
    },
    {
      "urdu": "خالہ زاد بھائی تھے وہ بیٹھے ہیں اور پھر اس کے بعد اور لوگ جن میں دوسرے اپ کے",
      "english": "was the maternal cousin, he was seated, and then after that other people, including your other"
    },
    {
      "urdu": "خالہ زاد بھائی ہیں حضرت بابا جی پیر سید سید محمد شفی رحمتہ اللہ علیہ اور وہ اپس",
      "english": "discussing something amongst themselves. The discussion is about a well in the mosque"
    },
    {
      "urdu": "میں کوئی ڈسکس ہو رہی ہے وہ ڈسکس کیا ہو رہی ہے کہ مسجد میں ایک",
      "english": "discussing something amongst themselves. The discussion is about a well in the mosque"
    },
    {
      "urdu": "کنواں لگا ہے اس سے پانی پینا جو ہے وہ کیسا ہے",
      "english": "whether drinking water from it is permissible or not. This discussion was going on"
    },
    {
      "urdu": "جو ڈسکس ہو رہی ہے جو بڑا حسین لمحہ تھا بڑے دھواں دھار سوالات جواب ہو رہے تھے",
      "english": "It was a beautiful moment. Very heated questions and answers were happening"
    },
    {
      "urdu": "اور اس سوالات جوابات میں بابا جی نے کیا فرمایا کہ اپ نے فرمایا بھئی جو میرے",
      "english": "And in this Q&A, what did Baba Ji say? He said my teacher - he didn't say which one"
    },
    {
      "urdu": "استاد تھے اب یہ نہیں کہا کہ کون سے تھے انہوں نے فرمایا تھا کہ اگر تو وہ کنواں",
      "english": "had said that if the well is endowed for the mosque, then its water is not for the general public but for the worshippers"
    },
    {
      "urdu": "مسجد کے لیے وقف ہے تو اس کا پانی عوام کے لیے جو ہے وہ نہیں ہوگا وہ نمازیوں کے لیے",
      "english": "If it's general, then the public can take water from it. Now this well is in the mosque"
    },
    {
      "urdu": "ہو گا اگر وہ عام ہے تو پھر عام لوگ اس سے پانی",
      "english": "They said build a small wall and put it outside the mosque's corner, so people can also drink"
    },
    {
      "urdu": "لے جا سکتے ہیں اب یہ جو کنواں مسجد میں لگا ہے اس کو مسجد کے باہر لگا ہے اسے",
      "english": "That was a beautiful moment. It was my childhood and those brothers, Masha Allah, were engaged in heated discussions"
    },
    {
      "urdu": "تھوڑی سی دیوار پھیر لگا کے اسے باہر نکال دو مسجد کا کونہ ہے مسجد سے مراد یہ نہیں",
      "english": "Similarly, I remember one phrase about this mourning food we cook in Pakistan"
    },
    {
      "urdu": "ہے یعنی کہ مسجد کا تھا ایک سیر کا کونہ تھا اسے باہر نکال دو تاکہ لوگ بھی پی",
      "english": "In our area we call it Khairat. The mourning food that's cooked. In our Azad Kashmir too"
    },
    {
      "urdu": "سکیں۔ تو وہ بڑی ایک حسین و جمیل ایک وہ لمحہ",
      "english": "I don't remember much. Just that someone said is it permissible or not? Some discussion was going on"
    },
    {
      "urdu": "تھا۔ میں میرا بچپن تھا اور وہ بھائی ماشاءاللہ بڑے دھواں دھار معاملات میں جو",
      "english": "Baba Ji smiled and said to Maulana Mian Saeed Shah Sahib - I know this much that mourning food is for travelers"
    },
    {
      "urdu": "سلسلہ کر رہے تھے۔ اسی طریقے سے ایک جملہ مجھے یاد ہے تھوڑا سا کہ یہ جو ہم لوگ",
      "english": "Keep this food as food, don't make it a feast. If you make it a feast, perhaps there won't be a permissible way"
    },
    {
      "urdu": "اپنے پاکستان میں ماتم داری کی روٹی پکاتے ہیں نا۔ ہمارے علاقے میں اسے خیرات کہتے",
      "english": "But if you make it a necessity, perhaps this matter will resolve. Those were beautiful moments"
    },
    {
      "urdu": "ہیں۔ ماتم کی روٹی جو پکتی ہے ہمارے ازاد کشمیر میں بھی۔ مجھے زیادہ یاد نہیں ہے۔",
      "english": "Those beautiful moments are still before me. Sometimes traveling on horseback with a caravan of devotees"
    },
    {
      "urdu": "اتنا یاد ہے کہ وہ کہا کہ جی وہ جائز ہے یا ناجائز؟ یہ کوئی بات چل رہی تھی تو",
      "english": "Those beautiful moments are still before me. Sometimes traveling on horseback with a caravan of devotees"
    },
    {
      "urdu": "مسکرا کے بابا جی نے فرمایا مولوی مولانا من سعید شاہ صاحب کو مولوی صاحب مجھے اتنا",
      "english": "Sometimes talking about Madinah Tayyibah, tears flowing from eyes. And what Naat was being recited"
    },
    {
      "urdu": "پتہ ہے کہ ماتم کی روٹی جو ہے وہ مسافرین کے لیے ہے اور اس روٹی کو روٹی رکھو سے",
      "english": "Sometimes talking about Madinah Tayyibah, tears flowing from eyes. And what Naat was being recited"
    },
    {
      "urdu": "ضیافت نہ بناؤ اگر ضیافت بنا دو گے تو پھر شاید کوئی جائز کی صورت نہ نکلے مگر اگر",
      "english": "A Naat was being recited: The cool shadows of your fasts, the cold breezes, O Wearer of the Blanket"
    },
    {
      "urdu": "ضرورت کی کوئی صورت بناؤ گے تو پھر شاید یہ سلسلہ نکلا ائے تو بڑے حسین لمحات ہوتے",
      "english": "And I remember two or three verses of another Naat. What beautiful moments they were"
    },
    {
      "urdu": "تھے بڑے حسین لمحات تھے وہ اج بھی میرے میرے سامنے ہیں کبھی گھوڑی پہ سفر ہو رہا",
      "english": "I remember till today that Naat which was: Every moment I await, of the Lord of the Black Blanket"
    },
    {
      "urdu": "غلاموں کا ایک قافلہ ساتھ ہے کبھی مدینہ طیبہ کی باتیں ہو رہی ہیں انکھوں سے",
      "english": "My eyes keep looking towards the paths of the Arabian camel riders"
    },
    {
      "urdu": "انسوؤں کی جھڑی لگی ہوئی ہے اور نعت پڑھنے والا کیا نعت پڑھ رہا ہے کہ اس وقت نعت",
      "english": "That Naat was being recited. Those were beautiful moments. But since it was childhood"
    },
    {
      "urdu": "پڑھی چادی تھی تیرے روزے دیاں ٹھنڈیاں چھاواں نالے سونیاں سرد ہواواں کملی والیا",
      "english": "In 64, he passed away. These two or three things are preserved in my mind"
    },
    {
      "urdu": "یہ ایک نعت تھی سبحان اللہ سبحان اللہ",
      "english": "Look, the thing is that when Pakistan came into existence, this is a long political question but I'll be brief"
    },
    {
      "urdu": "اور ایک نعت کا مجھے دو تین بول یاد ہیں کتنا حسین لمحے تھے اور کتنی ایک عجیب",
      "english": "When it was time to create Pakistan, in India's - if I say 100 percent, it's still correct - 99 percent"
    },
    {
      "urdu": "محفل تھی کہ نعت خوان تھے ایک بزرگ تھے اب وہ مجھے چونکہ بچپنا تھا مجھے یاد ہے اج",
      "english": "of the Mashaikh were determined to create Pakistan. Subhan Allah!"
    },
    {
      "urdu": "تک وہ کہ وہ نعت جو تھی وہ یہ تھی کہ ہر ویلے اڈیکاں رہندیاں نے کالی کملی والی",
      "english": "of the Mashaikh were determined to create Pakistan. Subhan Allah!"
    },
    {
      "urdu": "سرکار دیاں اکھاں مڑ مڑ تکدیاں رہندیاں نے راہوں عربی",
      "english": "And the slogan was: We will create Pakistan. The cry was: We will take Pakistan. Subhan Allah!"
    },
    {
      "urdu": "شتر زوار دیاں نہ پڑھی جا رہی تھی وہ تو حسین جمیل لمحات",
      "english": "In this regard, Hazrat's residence was in Lahore, Wasal Pura, Chowk Piranwala"
    },
    {
      "urdu": "تھے مگر چونکہ بچپنا تھا 64 میں اپ کا وصال ہو گیا یہ دو تین باتیں میرے ذہن میں",
      "english": "In this regard, Hazrat's residence was in Lahore, Wasal Pura, Chowk Piranwala"
    },
    {
      "urdu": "جو ہیں وہ محفوظ ہیں دیکھیں بات یہ ہے کہ یہ جو پاکستان معرض وجود میں ایا یہ بہت",
      "english": "In this regard, Hazrat's residence was in Lahore, Wasal Pura, Chowk Piranwala"
    },
    {
      "urdu": "لمبا ایک پولیٹکس کا ایک سوال ہے مگر میں اسے مختصر کروں گا",
      "english": "In this regard, Hazrat's residence was in Lahore, Wasal Pura, Chowk Piranwala"
    },
    {
      "urdu": "کہ جب پاکستان بنانے کی باری ائی تھی تو اس میں ہندوستان کے میں اگر یہ کہہ دوں کہ",
      "english": "In this regard, Hazrat's residence was in Lahore, Wasal Pura, Chowk Piranwala"
    },
    {
      "urdu": "100 فیصد تو پھر بھی ٹھیک ہے 99 فیصد مشائخ جو تھے وہ کمر بستہ تھے کہ پاکستان",
      "english": "Maulana Muhammad Bakhsh Muslim D Rahmatullah Alayhi was the special advisor to Hazrat Baba Ji Muhammad Ali Jinnah, Quaid-e-Azam"
    },
    {
      "urdu": "بنانا ہے سبحان اللہ",
      "english": "Quaid-e-Azam Sahib said that Muslim Sahib's matter doesn't seem to be working out"
    },
    {
      "urdu": "اور کلمہ کیا تھا کہ بنا کے رہیں گے پاکستان نعرہ کیا تھا لے کے رہیں گے",
      "english": "Quaid-e-Azam Sahib said that Muslim Sahib's matter doesn't seem to be working out"
    },
    {
      "urdu": "پاکستان سبحان اللہ",
      "english": "What should we do? Muslim Sahib said there is a Pir, an elder who has great influence in politics"
    },
    {
      "urdu": "اس سلسلے میں حضرت کا جو قیام تھا وہ لاہور وصل پورہ چوک پیرانوالہ میں تھا",
      "english": "The world calls him Pir Jamaat Ali Shah. If he comes under our influence, it would be great"
    },
    {
      "urdu": "مولانا محمد بخش مسلم ڈی رحمتہ اللہ علیہ حضرت بابا جی محمد علی جنا قائدا اعظم",
      "english": "When you went to him - now if anyone denies this, that's their choice, but what Muslim Sahib himself told me"
    },
    {
      "urdu": "رحمتہ اللہ علیہ کے مشیر خاص تھے ایڈوائزر تھے وہ تو قائدا اعظم صاحب نے یہ کہا کہ",
      "english": "Now I don't know what permissions were sought. In any case, Pakistan should be created"
    },
    {
      "urdu": "بھئی بات یہ ہے مسلم صاحب کی کوئی بات بنتی نظر نہیں ارہی",
      "english": "Muslim Sahib took Muhammad Ali Jinnah and presented himself to Baba Ji in Wasal Pura"
    },
    {
      "urdu": "اب کیا کریں تو مسلم صاحب نے کہا کہ جی بات یہ ہے کہ ایک",
      "english": "He came with a message. Baba Ji said tomorrow. The next day he summoned Amir-e-Millat"
    },
    {
      "urdu": "پیر بزرگ ہے جس کا پالیٹکس میں بڑا حصہ ہے ان کو دنیا کہتی ہے پیر جماعت علی شاہ",
      "english": "Hazrat Hafiz Ji Rahmatullah Alayhi came to him. He said Jamaat Ali Shah, I command you"
    },
    {
      "urdu": "وہ اگر ہمارے قابو ا جائیں تو بڑی بات ہے اپ جب ان کے پاس گئے اب اگر کوئی اس نے",
      "english": "to start a nationwide movement and go out with the flag of Pakistan. Allah will make you successful"
    },
    {
      "urdu": "جھٹلائے تو اس کی مرضی مگر جو بات مجھے مسلم صاحب نے خود بتائی تھی تو انہوں نے",
      "english": "Subhan Allah! Then Hazrat Amir-e-Millat submitted: Hazrat, if Pakistan is created, I will go out"
    },
    {
      "urdu": "کہا کہ جی میں تو اپنے شیخ کا اپنے مشائخ کے حکم کا پابند ہوں جدھر وہ مجھے چلائیں",
      "english": "If it's not created, what will happen? Sarkar said: Jamaat Ali Shah, this has been approved from the Court above"
    },
    {
      "urdu": "گے میں چلوں گا سبحان اللہ",
      "english": "Subhan Allah! This has been approved from the Court above"
    },
    {
      "urdu": "اب میں نہیں جانتا کہا کہا اجازم کیا ہے کیا ہے کیا ہے بہرح پاکستان بننا چاہیے",
      "english": "Subhan Allah! This has been approved from the Court above"
    },
    {
      "urdu": "مسلم صاحب نے محمد علی جناب کو ساتھ لیا اور وسن پورہ بابا جی کے پاس حاضر ہوئے",
      "english": "Subhan Allah!"
    },
    {
      "urdu": "پیغام لے کے ائے بابا جی نے فرمایا کہ کل جواب دے کے دوسرے دن اپ نے امیر ملت کو",
      "english": "he would say in Punjabi: Oh brother, my liver became cold, my liver became satisfied"
    },
    {
      "urdu": "طلب فرمایا حضرت حافظ جی رحمت اللہ علیہ اپ کے پاس حاضر ہوئے اپ نے فرمایا جماعت",
      "english": "And then after that, the fatwa that was issued - the truth should be told"
    },
    {
      "urdu": "علی شاہ میں تجھے حکم دیتا ہوں کہ ایک ہماگیر تحریک شروع کرو",
      "english": "The fatwa that was issued from Kuchocha Sharif - the present Hashmi Mian Sahib, their grandfather"
    },
    {
      "urdu": "اور پاکستان کا علم لے کے نکلو اللہ تمہیں کامیاب کرے گا۔",
      "english": "issued the fatwa. Samja Hasan Shah Sahib Rahmatullah Alayhi, Muhaddith Kuchochvi"
    },
    {
      "urdu": "سبحان اللہ اب حضرت امیر ملت نے یہ عرض کی کہ حضرت",
      "english": "The fatwa was that a Muslim who doesn't vote for Muslim League, if he dies, don't bury him in a Muslim cemetery"
    },
    {
      "urdu": "اگر پاکستان بنے تو میں نکلوں اگر نہ بنا تو پھر کیا بنے گا؟ تو سرکار نے فرمایا کہ",
      "english": "This was a very sensitive and strict fatwa. And this fatwa was verified by Hazrat Baba Ji Pir Haider Shah"
    },
    {
      "urdu": "جماعت علی شاہ یہ سرکار کی طرف سے منظوری ہو چکی ہے۔",
      "english": "Subhan Allah!"
    },
    {
      "urdu": "سبحان اللہ یہ سرکار کی طرف سے منظوری ہو چکی ہے۔",
      "english": "Subhan Allah!"
    },
    {
      "urdu": "سبحان اللہ یہ ہر ہر حال ملک بنے گا اور اس کے بنانے",
      "english": "Many religious institutions are established. The institutions named Jamia Haideria"
    },
    {
      "urdu": "کا سہرہ جو ہے وہ قائدا اعظم کے ساتھ ہوگا۔",
      "english": "You also have Jamia Haideria running. And Alhamdulillah there's one in Chura Sharif"
    },
    {
      "urdu": "سبحان اللہ پیر جماعت علی شاہ صاحب رحمت اللہ علیہ",
      "english": "You also have Jamia Haideria running. And Alhamdulillah there's one in Chura Sharif"
    },
    {
      "urdu": "فرماتے تھے کہ جب مجھے پیر خانے سے یہ حکم ملا تو پھر پنجابی میں یہ بات کہتے او",
      "english": "in Lahore too, in Rawalpindi too there's an institution running"
    },
    {
      "urdu": "بھئی بیلیو میرا جڑا کلیجہ سی نا سیر ہو گیا تڑی دنا میرا کلیجہ ہو گیا کہ مینوں",
      "english": "In Peer Badai near Fauji Colony, Alhamdulillah Jamia Haideria Mujaddidiyya is running"
    },
    {
      "urdu": "پتہ لگ می یقین ہو گیا سی کہ میں پاکستان بڑا کے رواں گا اور یہ پاکستان کے اندر",
      "english": "Similarly locally one is running in Mithi Sharif too, Jamia Haideria. In Lahore too. Then in Hanjer Rayald"
    },
    {
      "urdu": "پھر اس کے بعد وہ جو فتوی صادر ہوا تھا وہ فتوی حق حق بات جو ہے وہ کہنی چاہیے اس",
      "english": "near Gujranwala, there too. Many institutions are attributed to Baba Ji's name"
    },
    {
      "urdu": "میں یہ نہیں ہے کہ اپنے کم کریں یہ فتوی جو صادر ہوا تھا یہ کچوشہ شریف سے فتوی جو",
      "english": "Because whatever we get is the charity and blessing of your name"
    },
    {
      "urdu": "نکلا تھا یہ موجودہ جو ہیں حضرت ہاشمی میاں صاحب ان کے جو دادا حضور تھے انہوں",
      "english": "And it's our duty as servants that wherever we establish an institution, we attribute it to Hazrat's name"
    },
    {
      "urdu": "نے فتوی دیا تھا سمجھ گیا حسن شاہ صاحب رحمتہ اللہ علیہ کچوچھوی محدث کچوچھوی وہ",
      "english": "Subhan Allah! As for patronage, in Lahore, since part of his life was spent there"
    },
    {
      "urdu": "فتوی کیا تھا کہ جو مسلمان ہو کے مسلم لیگ کو ووٹ نہیں دیتا وہ مر جائے تو اسے",
      "english": "He greatly patronized Ahzab ul Anaf, patronized Jamia Naemania"
    },
    {
      "urdu": "مسلمانوں کے قبرستان میں دفناؤ گے یہ بڑا نازک بڑا نازک فتوی تھا اور سخت فتوی تھا",
      "english": "And as for mosques, he had many mosques built"
    },
    {
      "urdu": "اور اس فتوے کی تصدیق جو تھی وہ حضرت بابا جی پیر حیدر شاہ نے فرمائی تھی کہ جی جو",
      "english": "And as for mosques, he had many mosques built"
    },
    {
      "urdu": "فتو اس کا چھوشہ شریف سے ایا ہے یہ بالکل ٹھیک ہے اسے ہاتھ میں پکڑو اور نکلو اللہ",
      "english": "Many mosques were built, he left imams there and took their salary and maintenance upon himself"
    },
    {
      "urdu": "تمہیں کامیاب کرے گا سبحان اللہ",
      "english": "saying your only duty is to lead prayers and teach children the Quran. Subhan Allah!"
    },
    {
      "urdu": "بہت سے دینی ادارے قائم ہیں میں گن کے کیا بتاؤں وہ جتنے بھی ادارے قائم ہیں وہ",
      "english": "Teach the Quran, teach Hadith"
    },
    {
      "urdu": "جامعہ حیدریہ کے نام سے جن میں یہ اپ کے پاس بھی جامعہ حیدریہ چل رہا ہے اور",
      "english": "But after that, if any representative of any school came to him in any matter, he wouldn't send them empty-handed"
    },
    {
      "urdu": "الحمدللہ کہ چورہ شریف میں بھی ہے لاہور میں بھی ہے راولپنڈی میں بھی ادارہ جو ہے",
      "english": "He would always bestow something, patronize them. We have many proofs of where all he patronized"
    },
    {
      "urdu": "وہ چل رہا ہے تو یہ پیر بدائی کے پاس ہے فوجی کالونی اس میں الحمدللہ جامعہ حیدریہ",
      "english": "Even in Makkah Mukarramah, there was a school, its name was Salafiyya, Jamia Salafiyya"
    },
    {
      "urdu": "مجددیہ چل رہا ہے اسی طریقے سے لوکلی ایک مٹین شریف میں بھی چل رہا ہے جامعہ حیدریہ",
      "english": "But at that time it wasn't made into a particular sect. We have correspondence from there too"
    },
    {
      "urdu": "چل رہا ہے لاہور میں بھی چل رہا ہے اس کے بعد وہ حنجر رائلڈ میں چل رہا ہے جو",
      "english": "that Sarkar used to patronize them too. And during that time, there was also a school in Madinah Tayyibah"
    },
    {
      "urdu": "گوجرانوالہ کے پاس وہاں بھی چل رہا ہے بہت سارے ادارے ہیں جو بابا جی کے نام سے",
      "english": "which he patronized and sent his share there"
    },
    {
      "urdu": "منسوب ہیں وہ اس لیے کہ ہمیں تو جو کچھ بھی ملتا ہے تو اپ کے نام کا صدقہ اور",
      "english": "the school that was established, at that time Sarkar used to patronize that too"
    },
    {
      "urdu": "خیرات ملتا ہے اور ہمارا حق غلامی بھی یہی ہے کہ ہم جہاں بھی کوئی ادارہ قائم کرتے",
      "english": "And annually he would send them cash and would say with great joy"
    },
    {
      "urdu": "ہیں تو وہ حضرت کے نام سے ہی منسوب کرتے ہیں کہ یہ ادارہ فیض اپ کا ہے",
      "english": "Brothers, all the charity we receive is due to Hazrat Mujaddid Pak's blessing"
    },
    {
      "urdu": "سبحان سرپرستی کا جہاں تک تعلق ہے وہ تو لاہور میں چونکہ اپ کی زندگی کا ایک وقت",
      "english": "so why shouldn't we serve wholeheartedly? Subhan Allah!"
    },
    {
      "urdu": "گزرا ہے اپ نے ا حزب الاعناف کی بہت بڑی سرپرستی فرمائی جامعہ نعمانیہ کی سرپرستی",
      "english": "But you cannot even imagine how strict was the adherence to Shariah"
    },
    {
      "urdu": "فرمائی اور مساجد کا جہاں تک تعلق ہے بہت ساری مساجد اپ نے تعمیر کروائی ہیں",
      "english": "The adherence to Shariah was such that even in gatherings no one could do anything wrong"
    },
    {
      "urdu": "بہت ساری مساجد تعمیر کروائی ہیں وہاں پہ امام کو چھوڑا اور اس کی تنخواہ کفالت",
      "english": "I remember a religious scholar came - I won't mention his name - he had tied"
    },
    {
      "urdu": "اپنے ذمہ لی اور کہا کہ تیری صرف یہ ڈیوٹی ہے کہ تو نے نماز پڑھانی ہے اور بچوں کو",
      "english": "a turban with a very large tassel. Sarkar called him close with affection"
    },
    {
      "urdu": "قران قران کی تعلیم دینی ہے سبحان اللہ",
      "english": "a turban with a very large tassel. Sarkar called him close with affection"
    },
    {
      "urdu": "قران کی تعلیم دینی ہے حدیث شریف کی تعلیم دینی ہے مگر اس کے بعد یہ ہے کہ کوئی بھی",
      "english": "and said, Maulana, I have read that a small tassel is permissible"
    },
    {
      "urdu": "اگر کوئی از قسم مدرسہ کوئی سفیر کسی ضمن میں بھی اپ کے پاس پہنچتا تھا خالی نہیں",
      "english": "but keeping such a large one exceeds the limits. Allah!"
    },
    {
      "urdu": "لوٹاتے تھے اپ کچھ نہ کچھ عنایت فرماتے تھے سرپرستی فرماتے تھے جو ہمارے پاس کافی",
      "english": "Similarly, even young girls were not allowed to recite Quran loudly"
    },
    {
      "urdu": "اس چیز کے ثبوت پڑے ہوئے ہیں کہ کہاں کہاں اپ نے سرپرستی فرمائی ہے مکۃ المکرمہ میں",
      "english": "There was restriction on them too. Similarly, I observed that when"
    },
    {
      "urdu": "بھی جو مدرسہ تھا وہ وہ اس کا نام سلفیہ تھا جامعہ سلفیہ مگر اس وقت یہ نہیں تھا",
      "english": "Sarkar would put on blessed sandals, he would put the right foot in first"
    },
    {
      "urdu": "اس کو ایک کیا اسے کہتے ہیں کہ مسلک نہیں بنایا جاتا تھا وہاں کے بھی مسترداد",
      "english": "Subhan Allah! And if anyone made a mistake, he would correct them"
    },
    {
      "urdu": "معاملات ہمارے پاس ہیں کہ وہ بھی سرپرستی اپ سرکار فرماتے تھے اور اس دور میں مدینہ",
      "english": "matters we have, that too was under his patronage - Sarkar would guide, and in that era Medina"
    },
    {
      "urdu": "طیبہ میں بھی ایک مدرسہ تھا جس کی سرپرستی اپ فرماتے تھے اور اپنے سے حصہ وہاں",
      "english": "that all companions would eat together and he would say, say Bismillah loudly"
    },
    {
      "urdu": "بھیجتے تھے اور اس کے بعد جامعہ مجددیہ سرہان شریف میں حضرت مجدد پاک کی خانقاہ",
      "english": "so that each one can hear the other"
    },
    {
      "urdu": "کے اوپر جو مدرسہ قائم تھا اس وقت اس کی بھی اپ سرکار سرپرست ورتی فرماتے تھے",
      "english": "And there are many such matters - how many should I enumerate?"
    },
    {
      "urdu": "اور سالانہ وہ زر نقد کی صورت میں اپ وہاں بھیجتے تھے اور بڑے مزے سے فرماتے تھے کہ",
      "english": "But it wasn't harsh - there was no strictness. There was a way of explaining"
    },
    {
      "urdu": "بھائی سنگیو گالے صدقہ خیرات ہی مجدد پاک دا ہے ت اسیں کیوں نہ رج کے خدمت کریں",
      "english": "with gentleness, not harshness. He would explain in a unique manner"
    },
    {
      "urdu": "سبحان اللہ مگر اپ سوچ بھی نہیں سکتے کہ شریعت کی",
      "english": "Two elders from our Azad Kashmir, District Kotli, went to meet him"
    },
    {
      "urdu": "پابندی کا کیا عالم تھا شریعت کی پابندی کا یہ یہ عالم تھا کہ",
      "english": "His descendants are all in Bolton. The other who came to meet was Hakim Wilayat Khan"
    },
    {
      "urdu": "محفل میں بھی کوئی ادمی غلط کام نہیں کر سکتا تھا",
      "english": "His descendants are also in Bolton. Hakim Wilayat Khan didn't have a beard - he used to shave"
    },
    {
      "urdu": "مجھے یاد ہے کہ ایک عالم دین تشریف لائے نام میں نہیں بتاؤں گا تو وہ انہوں نے کلے",
      "english": "And Maulana Baqir Ali Sahib, being a Maulvi, had kept a beard"
    },
    {
      "urdu": "کے اوپر پگڑی باندھی ہوئی تھی اور اس کا جو شملہ تھا وہ بہت بڑا تھا پاس بلا کے",
      "english": "So Baba Ji Sarkar asked Maulvi Baqir Ali Khan - has it been applied?"
    },
    {
      "urdu": "بٹھا کے شفقت کی اور اپ نے فرمایا مولانا میں نے پڑھا ہے کہ کوئی تھوڑا سا شہاد کر",
      "english": "He replied yes. Then asked the other one - has it been applied?"
    },
    {
      "urdu": "کے تھوڑا سا شملہ جو ہے وہ تو جائز کی حد تک ہے مگر اتنا بڑا رکھ لینا جو ہے یہ حج",
      "english": "He said, wait a moment. Allahu Akbar!"
    },
    {
      "urdu": "تحد تجاوز میں پایا جاتا ہے۔ اللہ",
      "english": "Didn't say anything - wait a moment. They sat for one or two minutes"
    },
    {
      "urdu": "اسی طریقے سے شریعت کا یہ عالم تھا کہ بچیاں جو تھیں چھوٹی وہ بھی اونچا قران",
      "english": "and then Hakim Sahib used to say that much time passed but my wish was"
    },
    {
      "urdu": "نہیں پڑھ سکتی تھیں ان کے اوپر بھی پابندی تھی کہ اس کی گرفت",
      "english": "that when I present myself at Baba Ji's court, the Sunnah of Mustafa should be on my face"
    },
    {
      "urdu": "ہے یہ نہیں ہے اسی طریقے سے طریقے سے میں نے دیکھا کہ جب اپ نعلین پہنتے تھے جوڑا",
      "english": "that when I present myself at Baba Ji's court, the Sunnah of Mustafa should be on my face"
    },
    {
      "urdu": "مبارک پہنتے تھے تو سیدھا باؤس میں ڈالتے تھے",
      "english": "Subhan Allah! This was a practice - once a companion stood up to drink water"
    },
    {
      "urdu": "سبحان اللہ اور اگر کوئی غلطی کر لیتا تو اپ ٹوپ دیتے",
      "english": "Sarkar gestured for him to sit down. When he sat, Sarkar said"
    },
    {
      "urdu": "تھے کہ بھئی یہ نہیں ہے ایسے نہیں کرنا ہے کھانے کے معاملے میں بھی اتنی پابندی تھی",
      "english": "My Master the Prophet has said to drink water while sitting"
    },
    {
      "urdu": "کہ سب دوستوں نے مل کے کھانا کھانا ہے اور فرماتے فرماتے تھے کہ اتنی یار اونچی بسم",
      "english": "Subhan Allah! Subhan Allah! So these were many things. And another interesting thing"
    },
    {
      "urdu": "اللہ کہو بیلیو پڑھ چھڑیا کرو ایک دوجا سن لے",
      "english": "is that there was a Maulana, his name was Maulana Muhammad Fazl-e-Ilahi Rahmatullah Alayh"
    },
    {
      "urdu": "اور بہت سارے معاملات ہیں جس میں میں کہ کیا کیا گنوں اپ کو کتنے کتنے گن کے بتاؤں",
      "english": "In Baba Ji's gatherings, his duty was to give lessons in Hadith"
    },
    {
      "urdu": "مگر یہ نہیں ہے متشددانہ یعنی کہ تشدد نہیں تھا سمجھانے کا ایک طریقہ تھا اس میں",
      "english": "Subhan Allah! Hazoor himself would listen, the companions would listen too"
    },
    {
      "urdu": "تشدد نہیں تھا سختی نہیں تھی اپ عجیب انداز سے سمجھاتے تھے ہمارے ازاد کشمیر",
      "english": "And wouldn't say this was wrong - would say this point was missed by Maulana Sahib"
    },
    {
      "urdu": "ضلع کوٹلی کے دو بزرگ تھے وہ ملاقات کے لیے گئے",
      "english": "Since such things can be missed, it came to my mind so let me complete it"
    },
    {
      "urdu": "ملاقات کے لیے گئے ان کا نام بھی میں بتا دیتا ایک بزرگ جو تھے ان کا نام تھے حضرت",
      "english": "This was the style of teaching with love"
    },
    {
      "urdu": "مولانا محمد باقر علی خان ان کی اولاد یہ بولٹن میں ہیں سارے اور دوسرے جو ملنے کے",
      "english": "The wealth of love for the Prophet - even today, Alhamdulillah, my noble family"
    },
    {
      "urdu": "لیے ان کا نام تھا حکیم ولایت خان ان کی بھی اولاد بولٹن میں حکیم ولایت خان جو",
      "english": "is filled to the brim with it. Subhan Allah!"
    },
    {
      "urdu": "تھے ان کی داڑھی نہیں تھی وہ شیپ کرتے تھے اور مولانا باکر علی صاحب جو تھے وہ مولوی",
      "english": "Now see, there was a great scholar in Pakistan named Maulana Abdul Ghafoor"
    },
    {
      "urdu": "انہوں نے داڑھی رکھی ہوئی تھی تو بابا جی سرکار پوچھتے ہیں کہ مولوی باقر علی خان ک",
      "english": "Ghazalvi Rahmatullah Alayh, Sheikh-ul-Quran. Masha Allah, Subhan Allah!"
    },
    {
      "urdu": "لگنا لگی ہے",
      "english": "He was delivering a sermon and looked around"
    },
    {
      "urdu": "وہ خانہ ک لگنی دو تکو",
      "english": "and addressed Zahuri Sahib and Maulana Muhammad Hussain Gulfurosh"
    },
    {
      "urdu": "اللہ اکبر نہیں کی",
      "english": "He said, Brother Gulfurosh, tell Zahuri that here at Chura Sharif, speak very carefully"
    },
    {
      "urdu": "بتایا نہیں کیا دو تکو یہ دو ایک دو منٹ تک بیٹھے بس بیٹھ اور اس کے بعد حکیم صاحب",
      "english": "Here the ocean of love for Mustafa must be navigated carefully"
    },
    {
      "urdu": "یہ فرماتے تھے کہ جب میں بہت وقت ائے مگر میری خواہش یہ تھی کہ جب میں دربار میں",
      "english": "And if I slip slightly, young Sahihzadas are sitting here - don't think them small"
    },
    {
      "urdu": "بابا جی کے پاس حاضر ہوں تو میرے چہرے کے اوپر سنت مصطفی",
      "english": "they will catch me immediately. This is the situation"
    },
    {
      "urdu": "سبحان اللہ یہ ایک سلسلہ تھا کھڑے ہو کر ایک ساتھی نے",
      "english": "And I still remember the gathering at Khanqah Chura Sharif"
    },
    {
      "urdu": "پانی پیا تو اپ نے فرمایا ہم اشارہ کیا بیٹھ جاؤ جب بیٹھ گئے تو سرکار نے فرمایا",
      "english": "Hazoor Qibla Zia-ul-Ummat Pir Muhammad Karam Shah Al-Azhari"
    },
    {
      "urdu": "کہ میرے اقا نعمت نے یہ فرمایا ہے کہ پانی بیٹھ کے پیو",
      "english": "Allah! He was speaking and the scene was that"
    },
    {
      "urdu": "سبحان اللہ سبحان اللہ تو یہ بہت ساری باتیں اور پھر مزے کی بات",
      "english": "the Sahihzadas were swaying and tears were flowing from their eyes"
    },
    {
      "urdu": "یہ ہے کہ ایک مولانا صاحب تھے ان کا نام تھا مولانا محمد فضل الہی رحمتہ اللہ علیہ",
      "english": "When they stood for Salam and this verse was recited - those whose prostration"
    },
    {
      "urdu": "بابا جی کی محفل میں ان کی ڈیوٹی ہوتی تھی کہ وہ حدیث کا درس دیتے تھے",
      "english": "the mihrab of Kaaba used to bow for"
    },
    {
      "urdu": "سبحان اللہ حضور خود بھی سماعت فرماتے تھے دوست بھی",
      "english": "Ask anyone who was there - Pir Karam Shah Azhari also fell into prostration"
    },
    {
      "urdu": "سماعت بات کرتے تھے اور جب وہ درس ختم ہوتا تھا تو پھر خود حضرت اس کی تشریح",
      "english": "The Sahihzadas also fell into prostration, and all the people fell into prostration"
    },
    {
      "urdu": "فرماتے تھے اور یہ نہیں کہتے کہ یہ غلط کیا ہے کہتے یہ بات بھئی مولانا صاحب سے",
      "english": "And the one reciting Salam repeated this verse approximately 18 times"
    },
    {
      "urdu": "رہ گئی ہے چونکہ سلسلہ ایسا ہوتا ہے کہ کوئی بات رہ جائے یہ تو میرے ذہن میں یہ",
      "english": "Subhan Allah! And when he stopped, he said, for God's sake"
    },
    {
      "urdu": "ائی تو میں نے کہا میں پوری کر دوں اس کو یہ انداز تھا سمجھانے کا محبت",
      "english": "please raise your heads, I don't understand what to do"
    },
    {
      "urdu": "عشق رسول کی دولت تو اج بھی الحمدللہ کہ میرے خاندان عالیہ میں کوٹ کوٹ کے بھری",
      "english": "and in the pocket a watch. Blessed staff in hand"
    },
    {
      "urdu": "ہوئی ہے سبحان سبحان اللہ",
      "english": "and ask them any question - see what happens. And even today our state here is"
    },
    {
      "urdu": "اب یہ دیکھیں ذرا ایک بات پاکستان میں ایک بہت بڑے جید عالم ہوئے ہیں ان کا نام تھا",
      "english": "and ask them any question - see what happens. And even today our state here is"
    },
    {
      "urdu": "مولانا عبدالغفور غزالوی رحمتہ اللہ علیہ شیخ القران",
      "english": "that when the youth gather together - we are the old ones among them"
    },
    {
      "urdu": "ماشاءاللہ سبحان اللہ وہ وعض فرما رہے تھے تقریر فرما رہے تھے",
      "english": "When we sit together, I often tell the Sahihzadas"
    },
    {
      "urdu": "تو ادھر ادھر دیکھا نا ادھر ادھر دیکھ کے تو اپ نے ظہوری صاحب کو مخاطب کیا",
      "english": "You understand - he's a very good Naat reciter. And Ali Abbas Shah Sahib"
    },
    {
      "urdu": "اور ان کے ساتھ ایک ہوتے تھے مولانا اپنے محمد حسین گلفروش اپ نے ان کو مخاطب ہو کے",
      "english": "has a beautiful voice. And Hazrat Maulana Allama Sahihzada Muhammad Farooq-ul-Islam"
    },
    {
      "urdu": "تو یہ فرمایا کہ بھائی گل وے ظہوری کہ اتھے چورہ شریف بڑا سنبھل کے بولنا پونا",
      "english": "and recites beautiful Naat. Similarly among young Sahihzadas, Razi Abbas Sahib"
    },
    {
      "urdu": "اتھے محبت مصطفی عشق مصطفی نا سمندر ٹھانا مارنی پیا",
      "english": "is my cousin - son of my very affectionate uncle"
    },
    {
      "urdu": "تے ماں ذرا تھڑکی تے نکے نکے صاحبزادے بیٹھے نکا نہ سمجھ پچھو اڈے",
      "english": "All of them recite Naat together. Just a year ago, we were sitting in the mosque"
    },
    {
      "urdu": "مارنے تھڑک",
      "english": "All of them recite Naat together. Just a year ago, we were sitting in the mosque"
    },
    {
      "urdu": "یہ صورتحال ہے اور اج تک مجھے وہ عالم بھی یاد ہے کہ خانقاہ چورہ شریف پہ حس ہو رہا",
      "english": "so create some atmosphere. They said we'll create it right now"
    },
    {
      "urdu": "تھا حضور قبلہ عالم ضیاء الامت پیر محمد کرم شاہ الازہری",
      "english": "And they created such an atmosphere - three of them sat together and started reciting Naat"
    },
    {
      "urdu": "سبحان اللہ کشت عشق مصطفی",
      "english": "And that Naat was - we were sitting inside Baba Ji's mosque"
    },
    {
      "urdu": "اللہ بات فرما رہے تھے اور یہ عالم تھا کہ",
      "english": "The Naat was: The river of Your mercy flows openly"
    },
    {
      "urdu": "صاحبزادگان جھوم رہے تھے اور ان کی انکھوں میں انسوؤں کی لڑیاں ٹوٹ رہی تھیں",
      "english": "Subhan Allah! I'm receiving alms, my work is progressing"
    },
    {
      "urdu": "جب سلام کے لیے کھڑے ہوئے تو یہ سلام کا جب شعر پڑھا گیا کہ جن کے سجدے کو محراب",
      "english": "Subhan Allah! Your name is above the Throne, Your name is everywhere"
    },
    {
      "urdu": "کعبہ چکی تھی کوئی بندہ ملے تو پوچھ لینا کہ عالم یہ",
      "english": "And when they reached the final verse"
    },
    {
      "urdu": "تھا کہ پیر کرم شاہ ازری بھی سجدے میں گر گئے",
      "english": "that whatever I have is the charity of Mustafa, this slave lives on Your scraps"
    },
    {
      "urdu": "صاحبزادگان بھی سجدے میں گر گئے اور جتنی مخلوق تھی سارے سجدے میں گر گئے",
      "english": "All the Sahihzadas sitting in the mosque - screams and wails could be heard"
    },
    {
      "urdu": "اور سلام پڑھنے والے نے تقریبا 18 مرتبہ یہ شعر پڑھا",
      "english": "Alhamdulillah, the wealth of love for Mustafa was being distributed then"
    },
    {
      "urdu": "سبحان اللہ سبحان اللہ اور پھر جب چپ ہوا تو کہا کہ خدا کے لیے",
      "english": "and even today it is being distributed. Every young person, Alhamdulillah"
    },
    {
      "urdu": "جی اپ اپنے سروں کو اٹھاؤ مجھے سمجھ نہیں لگ رہی میں کیا کروں یہ محبت عشق رسول کی",
      "english": "and even today it is being distributed. Every young person, Alhamdulillah"
    },
    {
      "urdu": "ایک دولت جو ہے وہ عام ہے اج بھی میں اپ کو بڑے دعوے سے کہتا ہوں اعلان کرتا ہوں",
      "english": "you will find is practicing religion with love for Mustafa Karim in their heart"
    },
    {
      "urdu": "کہ کوئی بندہ چور شریف چلا جائے کسی صاحبزادے کو پکڑ لے اور بٹھا لے اور اس کو",
      "english": "And especially in this era when great people are wavering"
    },
    {
      "urdu": "کوئی کویسچن کر لے کوئی سوال کر لے بھلا دیکھو کیا بنتا ہے اور اج بھی ہمارا ادھر",
      "english": "Sahihzadas are wavering - but I say with pride that my Baba Ji's descendants"
    },
    {
      "urdu": "یہ عالم ہے کہ جب نوجوان مل کے بیٹھتے ہیں اب ہم تو یعنی کہ ان میں سے ہم بوڑھے ہیں",
      "english": "the youth, even today in matters of creed are so firm and steadfast"
    },
    {
      "urdu": "بوڑھے ہیں تو جب مل کے بیٹھتے ہیں تو میں کئی دفعہ کہتا ہوں صاحبزادگان کو کہ یار",
      "english": "that no one can shake them or challenge them"
    },
    {
      "urdu": "کوئی نعت سنا دو ان میں سے ہمارا ایک صاحبزادہ ہے فصیح الدین نام ہے اس کا بھی",
      "english": "The state of love for Mustafa is such that wherever you go - Ramadan in Madinah Munawwarah"
    },
    {
      "urdu": "سمجھ گئے ہو بڑی بڑا اچھا نعت خوان ہے سمجھ گئے ہو اور علی عباس شاہ صاحب ہیں",
      "english": "Alhamdulillah, Chura Sharif is being represented. Go for Hajj"
    },
    {
      "urdu": "بڑے اچھے خوشگلو ہیں بڑے اچھی ہے اور حضرت مولانا علامہ صاحبزادہ محمد فاروق الاسلام",
      "english": "the apple of my Baba Ji's eyes, my Baba Ji's pure progeny, Alhamdulillah"
    },
    {
      "urdu": "صاحب ہیں وہ بہت بڑے جید عالم بھی ہیں قاضی ہیں اور بہت بڑا ان کا گلا ہے اور",
      "english": "each one better than the other is spreading this wealth of love"
    },
    {
      "urdu": "بڑے خوبصورت نعت پڑھتے ہیں اسی طریقے سے نوخیز صاحبزادگان میں سے بڑے بڑے رضی عباس",
      "english": "At that time there were ships - steamers they called them"
    },
    {
      "urdu": "صاحب ہیں میرے چچا زاد بھائی ہیں میرے بڑے مشفق اور محسن مربی چچا کے بیٹے ہیں یہ وہ",
      "english": "Ships departed from Bombay - that was the port for all India"
    },
    {
      "urdu": "ہیں جو سارے مل کے نعت پڑھتے ہیں ابھی یہ ایک سال کی بات ہے مسجد میں بیٹھے ہوئے",
      "english": "and in the pocket a watch. Blessed staff in hand"
    },
    {
      "urdu": "تھے تو انہوں نے مجھ سے کہا کہ بھائی جان اپ خاموش بیٹھے ہوئے ہیں میں نے کہا یار",
      "english": "There were multiple attendances. Hajj at that time wasn't easy - it took 3-4 months"
    },
    {
      "urdu": "میری طبیعت ٹھیک نہیں ہے تو کچھ ماحول بناؤ انہوں نے کہا ابھی ہم اپ کو ماحول",
      "english": "Even going for Hajj took 3-4 months. So there were multiple attendances"
    },
    {
      "urdu": "بنا کے دے دیتے ہیں اور وہ ماحول کیا بنایا کہ وہ تین مل کے بیٹھ گئے اور انہوں",
      "english": "I don't have exact numbers but there were many blessed attendances"
    },
    {
      "urdu": "نے نعت پڑھنی شروع کر دی اور وہ نعت کیا تھی ورلہ مسجد کے اندر بابا جی مسجد کے",
      "english": "of Baba Ji Sahib in Madinah Tayyibah. Subhan Allah!"
    },
    {
      "urdu": "اندر بیٹھے ہوئے تھے اور وہ نعت کیا تھی تیری رحمتوں کا دریا سرعام چل رہا ہے",
      "english": "This is also a good question. The elders of that time, those who were peers of his"
    },
    {
      "urdu": "سبحان اللہ مجھے بھیکھ مل رہی ہے میرا کام چل رہا ہے",
      "english": "This is also a good question. The elders of that time, those who were peers of his"
    },
    {
      "urdu": "سبحان اللہ سر عرش نام تیرا فر سر عرش نام تیرا کہیں",
      "english": "after hearing this, each would teach their own spiritual path"
    },
    {
      "urdu": "نام چل رہا ہے اس طریقے سے اور پھر جب وہ اخری شعر پہ",
      "english": "For example, I'll mention Golra Sharif as a reference"
    },
    {
      "urdu": "پہنچے نا کہ میں یعنی کہ مجھے بھیک میرے پاس جو بھی",
      "english": "It's a sad thing today that there's a strange jealousy in hearts"
    },
    {
      "urdu": "کچھ ہے خیرات مصطفی کی تیرے ٹکڑوں پہ ہی اقا یہ غلام پڑھ رہا ہے جتنے صاحبزادگان",
      "english": "People don't even like to mention others' names. We weren't taught this"
    },
    {
      "urdu": "بیٹھے ہوئے تھے مسجد چیخیں چیخوں کی اواز دھاڑے مارنے کی اواز اتی تھی",
      "english": "We were taught that one who is miserly can never become a Faqir"
    },
    {
      "urdu": "الحمدللہ کہ عشق مصطفی کی دولت اس وقت بھی لٹ رہی تھی اج بھی جو ہے وہ باڑا بٹ رہا",
      "english": "He can never become a Sufi - one who is miserly. Indeed! Subhan Allah!"
    },
    {
      "urdu": "ہے اور ایک ایک نوجوان جو ہے الحمدللہ اپ کو نظر ائے گا متشرع ہوگا اور اس کے دل کے",
      "english": "and refresh our faith. Darbar Aaliya Golra Sharif is a great Khanqah of Chishti order"
    },
    {
      "urdu": "دماغ کے اندر مصطفی کریم کی محبت اور بالخصوص اج اس دور میں بڑے بڑے لوگ ڈول",
      "english": "And on their pulpit, two books were always present"
    },
    {
      "urdu": "رہے ہیں صاحب زادگاں ڈول رہے ہیں مگر میں جو یہ فخر سے کہتا ہوں کہ میرے بابا جی کی",
      "english": "And on their pulpit, two books were always present"
    },
    {
      "urdu": "اولاد جو ہے نوجوان اج بھی مسلک کے معاملے میں وہ اتنے پکے اور اتنے کٹر ہیں کہ کوئی",
      "english": "One was Muhyiddin Ibn Arabi's Fusus al-Hikam and one was Masnavi Sharif"
    },
    {
      "urdu": "ان کو ہلا بھی نہیں سکتا چھیڑ بھی نہیں سکتا عشق مصطفی کا یہ عالم ہے کہ جہاں",
      "english": "Hazrat Baba Ji Pir Mehr Ali Shah would regularly teach these. Subhan Allah!"
    },
    {
      "urdu": "کہیں بھی اپ رمضان کریم مدینہ منورہ جاؤ چورہ شریف کی الحمدللہ جو ہے وہ نمائندگی",
      "english": "and in the pocket a watch. Blessed staff in hand"
    },
    {
      "urdu": "ہو رہی ہے حج مبارک پہ جاؤ چورہ شریف کی نمائندگی ہو رہی ہے سب نوجوان جو ہے وہ",
      "english": "especially Baba Ji Sahib would regularly at night quote from Maktubat Sharif"
    },
    {
      "urdu": "ماشاءاللہ میرے بابا جی کے نور نظر میرے بابا جی کی اولاد پاک الحمدللہ ایک سے ایک",
      "english": "of Hazrat Mujaddid Pak and speak. The phrase would be: My Imam Rabbani has said this"
    },
    {
      "urdu": "بڑھ کے جو ہے وہ محبت کی دولت جو ہے اسے عام کر رہا ہے الحمدللہ یہ بھی چونکہ اس",
      "english": "My Imam Rabbani has said this. Allahu Akbar!"
    },
    {
      "urdu": "وقت بحری جہاز ہوتے تھے جن کو سٹیمر کہتے تھے اس وقت جہاز جو چلتے تھے وہ بمبے سے",
      "english": "This tradition continued - almost daily after Maghrib prayers"
    },
    {
      "urdu": "چلتے تھے بندرگاہ بمبے تھی ال انڈیا میں تو متعدد بار کی",
      "english": "this practice would continue. The phrase was always: My Imam Rabbani has said this"
    },
    {
      "urdu": "حاضری ہے چونکہ حج بھی اس وقت کوئی اسان نہیں تھا تین سے چار مہینے لگتے تھے حج",
      "english": "And he would often say, read Maktubat Sharif"
    },
    {
      "urdu": "کرنے کے اوپر بھی حج میں جنگ کو تین چار مہینے لگتے تھے تو متعدد حاضریاں ہیں اب",
      "english": "The blessed gathering - how do I describe it? Just understand it was like several suns"
    },
    {
      "urdu": "اس میں کتنی نہیں ہے کوئی اعداد میرے پاس تو نہیں ہے البتہ یہ ہے کہ بہت ساری جو",
      "english": "The blessed gathering - how do I describe it? Just understand it was like several suns"
    },
    {
      "urdu": "حاضریاں ہیں وہ الحمدللہ بابا جی صاحب کی مدینہ طیبہ کی ہیں",
      "english": "several moons. Subhan Allah! White face. Subhan Allah!"
    },
    {
      "urdu": "سبحان اللہ یہ بھی بڑا اچھا اپ کا سوال ہے اس وقت جو",
      "english": "And on the head, a white blessed turban. Subhan Allah!"
    },
    {
      "urdu": "بزرگ تھے وہ اس وقت اپ کے ہم اثر یہ سننے کے بعد قابل ہے وہ اپنی اپنی طریقت کا درس",
      "english": "On the shoulders, a black shawl. Locks flowing"
    },
    {
      "urdu": "دیتے تھے مثلا میں ذکر کروں گا حوالہ کوٹ کروں گا گولڑا شریف کا",
      "english": "As Riaz-ud-Din Sahib has a verse of Naat"
    },
    {
      "urdu": "یہ نہیں ہے اج عموما یہ ایک دکھ کی بات ہے کہ یہ دل کے اندر ایک عجیب سا حسد سمجھ",
      "english": "I'm not attributing it to them, it's a Naat verse"
    },
    {
      "urdu": "لیں یا کہ کیا کہتے ہیں پایا جائے کہ جی وہ اپنے نام دوسرے کسی کا نام لینا پسند",
      "english": "about the blessed locks swaying, displaying the glory of the Prophet"
    },
    {
      "urdu": "بھی نہیں کرتے نہیں ہمیں یہ درس نہیں ملا ہے ہمیں یہ درس ملا ہے کہ جو بخیل ہے نا",
      "english": "Swaying locks demonstrating the honor of the Trustworthy One"
    },
    {
      "urdu": "بخیل وہ کبھی فقیر نہیں بن سکتا وہ کبھی صوفی نہیں بن سکتا جو بخیل ہے",
      "english": "I don't know if this Naat is recited anymore - Riaz-ud-Din Sordi Sahib recited it to me"
    },
    {
      "urdu": "بے شک سبحان اللہ تو بڑے وثوق کے ساتھ الحمدللہ ہم تو",
      "english": "I don't know if this Naat is recited anymore - Riaz-ud-Din Sordi Sahib recited it to me"
    },
    {
      "urdu": "صوفیاء کا ذکر کرتے ہیں اپنے ایمانوں کو تازہ کرتے ہیں جیسے کہ",
      "english": "in Madinah Pak 20-25 years ago. So the locks, white blessed beard"
    },
    {
      "urdu": "دربار عالیہ گولڑا شریف سلسلہ چشتی کی بہت بڑی خانقاہ ہے اور وہاں کا جو ممبر تھا نا",
      "english": "practicing Shariah, Masha Allah! Good height, reddish complexion"
    },
    {
      "urdu": "خطبے والا اس کے اوپر دو کتابیں پڑھی ہوتی تھیں ایک محی الدین ابن عربی کی خصوص",
      "english": "shawl on shoulders of light pearl color. Sometimes white Boski coat with a chain"
    },
    {
      "urdu": "الحکم اور ایک مثنوی شریف حضرت بابا جی پیر مہر علی شاہ باقاعدہ اس کا درس دیتے",
      "english": "and in the pocket a watch. Blessed staff in hand"
    },
    {
      "urdu": "تھے سبحان اللہ",
      "english": "The staff would come up to here - to the waist. And the walking style"
    },
    {
      "urdu": "درس ہوتا تھا اسی طریقے سے ہمارے خواجگان میں بھی اور بالخصوص بابا جی صاحب کے بھی",
      "english": "The staff would come up to here - to the waist. And the walking style"
    },
    {
      "urdu": "باقاعدگی سے رات کو مکتوبات شریف کا حوالہ کوٹ کر کے مجدد پاک کے مکتوبات کا حوالہ",
      "english": "was neither fast nor slow - moderate. And not in the habit of talking while walking"
    },
    {
      "urdu": "دے کے سرکار گفتگو فرماتے تھے میرے اپ لفظ کیا ہوتا میرے امام ربانی نے یہ فرمایا ہے",
      "english": "When walking, walk silently. Don't talk while standing"
    },
    {
      "urdu": "میرے امام ربانی نے یہ فرمایا ہے اللہ اکبر",
      "english": "When you start walking, just walk. This was the style. What more can I tell you"
    },
    {
      "urdu": "یہ یہ روایت چلتی تھی اور وہ یہ نہیں ہے کہ ایک دن تقریبا",
      "english": "what he was like, how he was. That blessed sight is now forgotten. Subhan Allah!"
    },
    {
      "urdu": "روز ہی بعد اعداد نماز مغرب یہ سلسلہ جو تھا یہ چلتا تھا مگر جملہ یہی ہوتا تھا کہ",
      "english": "From one mother's lineage, the eldest was Pir Haider Shah Sahib"
    },
    {
      "urdu": "میرے امام ربانی نے یہ فرمایا ہے اور اپ اکثر فرماتے تھے کہ مکتوبات شریف کو پڑھو",
      "english": "From one mother's lineage, the eldest was Pir Haider Shah Sahib"
    },
    {
      "urdu": "اور اس کو گلے لگاؤ اور اس سے کوئی فائدہ حاصل کرو",
      "english": "The younger one was Pir Mahboob Shah Sahib"
    },
    {
      "urdu": "سبحان اللہ یا مبارک تو پھر اب میں کس چیز سے تشبیہ",
      "english": "The younger one was Pir Mahboob Shah Sahib"
    },
    {
      "urdu": "دوں کہ کیسا تھا بس یہ سمجھ لیں کہ چند افتاب",
      "english": "Younger than them was Pir Roshan Shah Sahib"
    },
    {
      "urdu": "چند مہتاب سبحان اللہ",
      "english": "But during this time, Hazoor's mother passed away and Hazoor Qibla Baba Ji"
    },
    {
      "urdu": "سفید چہرہ سبحان اللہ",
      "english": "But during this time, Hazoor's mother passed away and Hazoor Qibla Baba Ji"
    },
    {
      "urdu": "اور سر کے اوپر سفید امامہ مبارک سبحان اللہ",
      "english": "Zulfan Wali Sarkar married a second time from Muzaffarabad"
    },
    {
      "urdu": "کندھے کے اوپر کالی چادر زلفیں اویزاں اور جیسے کہ وہ ریاض الدین",
      "english": "From that Mai Sahiba, one son was born. She also passed away"
    },
    {
      "urdu": "صاحب نے ایک نعت کا شعر ہے وہ وہ میں یہ نہ کہہ رہا ہوں کہ ان کے ساتھ منسوب کر",
      "english": "From that Mai Sahiba, one son was born. She also passed away"
    },
    {
      "urdu": "رہا ہوں وہ نعت کا شعر ہے کہ وہ ہے نا کہ ان کا شعر ہے",
      "english": "That son - Mian Ghulam Rasool Sahib from Muzaffarabad"
    },
    {
      "urdu": "اپنے",
      "english": "Barmala - our cousin family still lives there"
    },
    {
      "urdu": "گیسو پیش تے پیش پیکاون سونے نبی دی شان وداون",
      "english": "These Muzaffarabad Gilanis are our cousin family - we have relations with them"
    },
    {
      "urdu": "لٹک لٹک کے شان اتے ہلکے بنن امین دے یہ پتہ نہیں یہ نعت پڑھی بھی جاتی ہے کہ",
      "english": "whether from Muzaffarabad, or Garhi Dupatta, or Bangla Saidaan"
    },
    {
      "urdu": "نہیں مجھے ریاض الدین سوردی صاحب نے مدینہ پاک میں یہ مجھے نعت سنائی تھی 20 25 سال",
      "english": "That Sahihzada's blessed name was Baba Ji Pir Sarwar Shah Rahmatullah Alayh"
    },
    {
      "urdu": "کی سال کی پہلے کی بات ہے یہ تو مجھے تھا کہ زلفیں سفید داڑھی مبارک متشرے",
      "english": "meaning age-wise he was the youngest of all"
    },
    {
      "urdu": "ماشاءاللہ خوب قد سرخ کلر رنگ کندھے پہ چادر مبارک تو ہلکے موتیہ کلر کی بوسکی",
      "english": "The atmosphere was such that no one felt different. Their appearance"
    },
    {
      "urdu": "کلر کی کبھی کبھی سفید بیسک کوٹا پہنتے تھے جس کے ساتھ ایک زنجیر ہوتی تھی اور",
      "english": "showed they were brothers. Very few people knew their mothers were different"
    },
    {
      "urdu": "زنجیر کے ساتھ جیب میں گھڑی ہوتی تھی پاکٹ ماچ ہاتھ میں اسا مبارک اسا مبارک جو تھا",
      "english": "He was also Masha Allah very handsome and beautiful"
    },
    {
      "urdu": "وہ یہاں تک اتا تھا کمر تک ہوتا تھا اور چلنے کا انداز بھی یہ تھا کہ نہ تیز چلتے",
      "english": "Sarkar's blessed age - when he passed away"
    },
    {
      "urdu": "تھے نہ اہستہ چلتے تھے میانہ روی کے ساتھ چلتے تھے اور چل چلتے چلتے باتیں کرنے کے",
      "english": "he himself had mentioned somewhere that his age was around 125 years"
    },
    {
      "urdu": "عادی نہیں تھے۔ جب چلنا ہے تو خاموشی سے چلنا ہے۔ نہ کھڑے ہو کے بات کرنی ہے۔ جب",
      "english": "he himself had mentioned somewhere that his age was around 125 years"
    },
    {
      "urdu": "گھر سے چل پڑنا ہے پیدل چلنا ہے تو پھر چل ہی پڑنا ہے۔ یہ انداز تھا۔ اور کیا بتاؤں",
      "english": "Subhan Allah! But the amazing thing was"
    },
    {
      "urdu": "کیا تھا کیسے تھا۔ وہ تو بھول گیا مبارک اور",
      "english": "that he never wore glasses his entire life. Subhan Allah!"
    },
    {
      "urdu": "سبحان اللہ۔ بس تو پھر جنہوں نے دیکھا ہے وہی بتا سکتے",
      "english": "Never wore glasses and never said that he couldn't hear properly"
    },
    {
      "urdu": "ہیں۔ حضور قبلہ اعلی بابا جی صاحب رحمتہ اللہ",
      "english": "Never wore glasses and never said that he couldn't hear properly"
    },
    {
      "urdu": "علیہ جنہوں نے ایک اماں جی کے وطن سے جنم لیا۔ ان میں بڑے جو تھے وہ پیر حیدر شاہ",
      "english": "And his study habit was such - a small cot with woven rope, a small old broken table"
    },
    {
      "urdu": "صاحب تھے۔ چھوٹے جو تھے وہ پیر محبوب شاہ صاحب تھے۔",
      "english": "and Hadith Sharif would be open on it. I remember to this day"
    },
    {
      "urdu": "ان سے چھوٹے جو تھے وہ پیر روشن شاہ صاحب تھے",
      "english": "sometimes Ibn Kathir would be open, meaning Quran commentaries, Hadith Sharif"
    },
    {
      "urdu": "مگر اس دوران حضور کی والدہ ماجدہ کا انتقال ہو گیا اور حضور قبلہ بابا جی",
      "english": "sometimes Ibn Kathir would be open, meaning Quran commentaries, Hadith Sharif"
    },
    {
      "urdu": "زلفاں والی سرکار نے مظفراباد سے عقد ثانی کیا وہ جو مائی صاحبہ تھیں ان",
      "english": "And that study was essential - all by lantern light"
    },
    {
      "urdu": "سے ایک صاحبزادے ہوئے وہ مائی صاحبہ بھی انتقال کر گئیں یہ جو ہوئے ہیں نا یہ مولا",
      "english": "but never said my eyesight has weakened or my hearing has weakened"
    },
    {
      "urdu": "اپنے میں میاں غلام رسول صاحب مظفراباد والے اسمبلی سے سپیکر بھی رہے ہیں اس خان",
      "english": "Sarkar could hear even the softest voice but wouldn't immediately respond"
    },
    {
      "urdu": "خاندان سے تو اس جگہ کا نام ہے برمالہ کیا جگہ کا نام ہے",
      "english": "If someone said something, wouldn't reply - for confirmation would ask another"
    },
    {
      "urdu": "برمالہ برمالہ اب بھی وہاں پہ ہماری چچیری فیملی",
      "english": "what was said, then would respond. The sequence was"
    },
    {
      "urdu": "اباد ہے یہ مظفراباد والے گیلانی جو ہیں یہ ہماری چچیری فیملی ہے ان کے ساتھ ہمارے",
      "english": "what was said, then would respond. The sequence was"
    },
    {
      "urdu": "رشتے ہیں کہ مظفراباد والے ہو گئے یا اگے گڑی دوپٹہ والے ہو گئے یا اگلے وہ کیا اسے",
      "english": "first Hazrat Baba Ji Pir Roshan Shah Sahib Roshan Din, the younger brother, passed away"
    },
    {
      "urdu": "کہتے ہیں کہ بنگلہ سعیداں والے ہو گئے تو وہ جو صاحبزادے تھے ان کا اسم شریف تھا",
      "english": "He was very handsome, Masha Allah, and young when he passed away"
    },
    {
      "urdu": "بابا جی پیر سرور شاہ رحمتہ اللہ علیہ یعنی کہ وہ عمر کے لحاظ سے یہ چھوٹے تھے",
      "english": "He was very handsome, Masha Allah, and young when he passed away"
    },
    {
      "urdu": "سب سے چھوٹے تھے وہ مگر باہر کے وہ بھی چونکہ صاحبزادے تھے اب میں نے دیکھے ہیں",
      "english": "Our burial custom is that women's graves are separate, men's graves are separate"
    },
    {
      "urdu": "اور محسوس نہیں ہوتا تھا یعنی کہ ایسا سلسلہ تھا کہ کوئی محسوس نہیں کرتا تھا ان",
      "english": "Pir Roshan Shah Sahib's grave was made. Then Pir Sarwar Shah Sahib"
    },
    {
      "urdu": "کی شکل و صورت ظاہر ہے کہ وہ بھائی تھے بیٹھو گے کسی کسی کو پتہ تھا کہ یہ ان کی",
      "english": "Baba Ji's grave is in Muzaffarabad Barmala Sharif"
    },
    {
      "urdu": "مایا الگ الگ ہے مگر بہت کم لوگوں کو اس چیز کا پتہ تھا وہ بھی ماشاءاللہ بڑے حسین",
      "english": "Then when grandfather passed away, his grave was made beside Baba Ji Zulfan Wali Sarkar"
    },
    {
      "urdu": "بڑے جمیل اور بڑے شکیل تھے وہ بھی دیکھنے کے قابل تھے",
      "english": "Then Pir Mahboob Shah Sahib passed away"
    },
    {
      "urdu": "سبحان اللہ سرکار کی عمر مبارک جو تھی جب اپ نے وصال",
      "english": "and was buried in the adjacent chamber. That's all - nothing special about it"
    },
    {
      "urdu": "فرمایا تو خود کہیں اپ نے اس کا ذکر کیا تھا کہ 125 سال کے قریب میری عمر ہے",
      "english": "The dust returned to where its origin was. Subhan Allah! Subhan Allah!"
    },
    {
      "urdu": "سبحان اللہ مگر یہ عجیب اچھبے کی بات جو بات تھی وہ",
      "english": "Subhan Allah! But this was such an amazing thing"
    },
    {
      "urdu": "یہ تھی کہ تاحیات چشمہ نہیں لگایا سبحان اللہ",
      "english": "The fact is that throughout his life he never wore glasses. Subhan Allah!"
    },
    {
      "urdu": "چشمہ نہیں لگایا اور تا حیات یہ بھی نہیں کہا کہ بھئی کیا کہا میں اونچا سنتا ہوں",
      "english": "Never wore glasses, and throughout his life never said \"What did you say? I can't hear well\""
    },
    {
      "urdu": "یہ بھی نہیں کہا اللہ سبحان اللہ",
      "english": "Never wore glasses, and throughout his life never said \"What did you say? I can't hear well\""
    },
    {
      "urdu": "اور مطالعے کا یہ عالم تھا کہ ایک چھوٹی سی چارپائی بان کی ایک ایک ادھر چھوٹا سا",
      "english": "And his dedication to study was such that there was a small rope cot, and here a small"
    },
    {
      "urdu": "پرانے زمانے کا ٹوٹا پھوٹا ٹیبل پڑھا ہوا ہے اور اس کے اوپر حدیث شریف پڑھی ہوتی",
      "english": "old broken table would be placed, and on it the Hadith Sharif would be open"
    },
    {
      "urdu": "تھی مجھے اج تک یاد ہے کہ کبھی تو ابن کثیر پڑھی ہوتی تھی تو کبھی یعنی کہ قران",
      "english": "I still remember that sometimes Tafsir Ibn Kathir would be open, and sometimes the Quran"
    },
    {
      "urdu": "کریم کی تفسیریں حدیث شریف پڑھی ہوتی تھی تو وہ مطالعہ اپ نے کرنا تو اور بھی بہت",
      "english": "Kareem's commentaries and Hadith Sharif would be studied. He would do this study, and many other"
    },
    {
      "urdu": "ساری کتابیں جو اپ کے مطالعہ میں رہتی تھیں اور وہ مطالعہ لازمی کرنا اور وہ بھی",
      "english": "books were in his regular reading, and this study was mandatory, and that too"
    },
    {
      "urdu": "لالٹین کے اوپر مگر یہ نہیں کہا کہ مجھے میری نظر کمزور ہو گئی ہے یا میری سماعت",
      "english": "by lantern light. But he never said \"My eyesight has weakened\" or \"My hearing"
    },
    {
      "urdu": "کمزور ہے ہلکی سے ہلکی بات بھی سرکار سن لیتے مگر سن کے جواب نہیں دیتے تھے اگر",
      "english": "has weakened.\" He would hear even the softest word, but wouldn't reply immediately - if"
    },
    {
      "urdu": "کسی نے کوئی عرض بھی کیا ہے تو جواب نہیں دیتے تھے تصدیق کے لیے اپ دوسرے سے پوچھتے",
      "english": "someone made a request, he wouldn't respond right away. For confirmation he would ask another person"
    },
    {
      "urdu": "تھے کس نے کیا کہا ہے پھر اپ جواب دیتے تھے وہ یہ ہے کہ چونکہ سلسلہ وار",
      "english": "what was said, then he would respond. The sequence was"
    },
    {
      "urdu": "پہلے حضرت بابا جی پیر روشن شاہ صاحب روشن دین جو چھوٹے بھائی تھے ان کا وصال ہوا وہ",
      "english": "first Hazrat Baba Ji Pir Roshan Shah Sahib Roshan Din, the younger brother, passed away. He was"
    },
    {
      "urdu": "بڑے ماشاءاللہ خوبصورت اور چھوٹے جو نوجوانی میں ان کا وصال ہو گیا اب ہمارے",
      "english": "Masha Allah very handsome and young when he passed away. Now our"
    },
    {
      "urdu": "ادھر تدفین کا یہ طریقہ کار ہے کہ مستور کی قبریں الگ ہوتی ہیں مردوں کی قبریں الگ",
      "english": "burial custom here is that women's graves are separate, men's graves are separate"
    },
    {
      "urdu": "ہوتی ہیں پیر روشن شاہ صاحب کی قبر لگ گئی اور وہ قبر جو تھی وہ لگ گئی اس وقت اس کے",
      "english": "Pir Roshan Shah Sahib's grave was made. And that grave was established at that time. After that"
    },
    {
      "urdu": "بعد پیر سرور شاہ صاحب بابا جی جو تھے ان کی قبر مبارک مظفراباد برمالہ شریف میں ہے",
      "english": "Pir Sarwar Shah Sahib Baba Ji's blessed grave is in Muzaffarabad Barmala Sharif"
    },
    {
      "urdu": "اس کے بعد پھر دادا جی صاحب کا جب وصال ہوا تو بابا جی زلفوں والی سرکار کے ساتھ",
      "english": "Then when grandfather passed away, his grave was made beside Baba Ji Zulfan Wali Sarkar"
    },
    {
      "urdu": "ان کی قبر بنا دی گئی اس کے بعد جو تھا وصال پھر پیر محبوب شاہ صاحب کا ہوا ساتھ",
      "english": "Then Pir Mahboob Shah Sahib passed away, and"
    },
    {
      "urdu": "دوسرے حجرے میں ان کی تدفین ہو گئی بس یہ تھا یہ کوئی خاص اس میں نہیں ہے وہ بس",
      "english": "was buried in the adjacent chamber. That's all - nothing special about it. Just"
    },
    {
      "urdu": "پہنچی وہیں پہ خاک جہاں کا خمیص تھا سبحان اللہ سبحان اللہ",
      "english": "the dust returned to where its origin was. Subhan Allah! Subhan Allah!"
    }
  ]
}