{
  "id": "school",
  "category": "news",
  "title": {
    "urdu": "ہوم ورک نہ کرنے پر بچوں کو نیم برہنہ کر کے سزا: 'سب کے سامنے صرف انڈرویئر میں کھڑا کر دیا جائے تو دماغ پر کیا اثر پڑے گا'",
    "english": "Children Punished by Being Made Semi-Naked for Not Doing Homework: 'What Effect Will It Have on the Mind if Made to Stand in Just Underwear in Front of Everyone?'"
  },
  "vocabulary": {
    "ہوم ورک": "homework",
    "بچوں": "children",
    "بچے": "children",
    "بچہ": "child",
    "نیم برہنہ": "semi-naked",
    "برہنہ": "naked",
    "سزا": "punishment",
    "انڈرویئر": "underwear",
    "کھڑا": "standing",
    "کھڑے": "standing",
    "دماغ": "mind",
    "اثر": "effect",
    "انڈیا": "India",
    "ریاست": "state",
    "پرائیویٹ": "private",
    "نجی": "private",
    "سکول": "school",
    "جماعت": "class/grade",
    "آٹھ": "eight",
    "طالب علموں": "students",
    "دسمبر": "December",
    "تصویر": "photo",
    "سوشل میڈیا": "social media",
    "وائرل": "viral",
    "اہلخانہ": "family",
    "خاندان": "family",
    "پتہ": "knowledge",
    "علم": "knowledge",
    "معلوم": "knowledge",
    "شرم": "shame",
    "شرمندہ": "ashamed",
    "بتایا": "told",
    "تعلیم": "education",
    "بہتر": "better",
    "کپڑے": "clothes",
    "مجرم": "criminal",
    "واقعے": "incident",
    "واقعہ": "incident",
    "تصدیق": "confirmation",
    "راہداری": "corridor",
    "غلط": "wrong",
    "معاملے": "matter",
    "معاملہ": "matter",
    "پرنسپل": "principal",
    "صحافیوں": "journalists",
    "سیاسی": "political",
    "ڈسٹرکٹ ایجوکیشن آفیسر": "District Education Officer",
    "لاکھ": "lakh (100,000)",
    "روپے": "rupees",
    "جرمانہ": "fine",
    "سکیورٹی گارڈ": "security guard",
    "ڈرائیور": "driver",
    "برطرف": "dismissed",
    "والد": "father",
    "دکان": "shop",
    "دو": "two",
    "بیٹے": "sons",
    "بیٹا": "son",
    "سنگین": "serious",
    "جرم": "crime",
    "دن": "day",
    "روز": "day",
    "گارڈز": "guards",
    "مارتے": "beaten",
    "مارا پیٹا": "beaten",
    "فیس": "fees",
    "ہزاروں": "thousands",
    "ذہنی صحت": "mental health",
    "والدین": "parents",
    "الزام": "allegation",
    "الزامات": "allegations",
    "صفائی": "cleaning",
    "پانی": "water",
    "غلطیاں": "mistakes",
    "دھمکیاں": "threats",
    "شکایات": "complaints",
    "تحقیقات": "investigation",
    "نومبر": "November",
    "سردی": "cold",
    "نظم و ضبط": "discipline",
    "ناقابل قبول": "unacceptable",
    "درست": "correct",
    "سات": "seven",
    "مستقبل": "future",
    "پولیس": "police",
    "قانونی": "legal",
    "کارروائی": "action"
  },
  "paragraphs": [
    {
      "urdu": "انڈیا کی ریاست مدھیہ پردیش میں ایک پرائیویٹ سکول میں ساتویں جماعت کے آٹھ طالب علموں کو ہوم ورک نہ کرنے پر نیم برہنہ کر دیا گیا۔",
      "english": "In India's state of Madhya Pradesh, eight seventh-grade students at a private school were made semi-naked for not doing homework."
    },
    {
      "urdu": "25 دسمبر کو انڈرویئر اور بنیان میں کھڑے بچوں کی ایک تصویر سوشل میڈیا پر وائرل ہوئی۔",
      "english": "On December 25th, a photo of children standing in underwear and vests went viral on social media."
    },
    {
      "urdu": "بی بی سی ہندی سے بات کرتے ہوئے ان بچوں میں سے ایک کے اہلخانہ نے کہا کہ 'ہمیں کچھ پتہ نہیں تھا۔ بچے نے شرم سے ہمیں نہیں بتایا لیکن بچے کے لیے ایسی تعلیم سے بہتر ہے کہ وہ ان پڑھ ہی رہے۔'",
      "english": "Speaking to BBC Hindi, a family member of one of these children said: 'We didn't know anything. The child was ashamed and didn't tell us, but for the child, it's better to remain uneducated than to receive such education.'"
    },
    {
      "urdu": "ان کا مزید کہنا تھا کہ 'اگر اسے سب کے سامنے کپڑے اتار کر صرف انڈرویئر میں کھڑا کر دیا جائے تو اس کے دماغ پر کیا اثر پڑے گا؟ کیا وہ کوئی مجرم تھا؟'",
      "english": "They further said: 'If he is made to stand in just underwear with clothes removed in front of everyone, what effect will it have on his mind? Was he a criminal?'"
    },
    {
      "urdu": "اس تصویر کے وائرل ہونے کے بعد سیہور کے ڈسٹرکٹ ایجوکیشن آفیسر نے بی بی سی کو بتایا کہ 'مجھے اس واقعے کا علم 26 دسمبر کو ہوا، جس کے بعد میں خود سکول گیا، بچوں سے بات کرنے کے بعد اس بات کی تصدیق ہوئی کہ بچوں کو ہوم ورک نہ کرنے پر بغیر کپڑوں کے راہداری میں کھڑا کر دیا گیا، جو سراسر غلط ہے۔'",
      "english": "After this photo went viral, Sehore's District Education Officer told the BBC: 'I learned about this incident on December 26th, after which I personally went to the school. After speaking with the children, it was confirmed that the children were made to stand in the corridor without clothes for not doing homework, which is completely wrong.'"
    },
    {
      "urdu": "تاہم اسی معاملے میں پرنسپل ثمرین خان نے 26 دسمبر کو صحافیوں کو بتایا تھا کہ 'یہ ایک سیاسی سٹنٹ ہے اور ہم کیا کہہ سکتے ہیں۔'",
      "english": "However, in this same matter, Principal Samreen Khan had told journalists on December 26th: 'This is a political stunt and what can we say.'"
    },
    {
      "urdu": "سیہور کے ڈسٹرکٹ ایجوکیشن آفیسر نے کہا کہ ہم نے اس معاملے میں سکول پر ایک لاکھ روپے کا جرمانہ عائد کیا ہے اور پرنسپل، سکیورٹی گارڈ اور ڈرائیور کو فوری طور پر برطرف کرنے کا حکم دیا ہے۔",
      "english": "Sehore's District Education Officer said that they have imposed a fine of one lakh rupees on the school in this matter and have ordered the immediate dismissal of the Principal, security guard, and driver."
    },
    {
      "urdu": "ایک بچے کے والد جنھوں نے بی بی سی سے بات کی، ان کا کہنا ہے کہ انھوں نے اپنے بچے کو بہتر تعلیم کے لیے ایک پرائیویٹ سکول میں داخل کرایا تھا۔",
      "english": "A child's father who spoke with the BBC says that he had enrolled his child in a private school for better education."
    },
    {
      "urdu": "وہ کہتے ہیں کہ 'میں ایک چھوٹی دکان چلاتا ہوں اور میرے دو بیٹے ہیں۔ میں نے اپنے چھوٹے بیٹے کو اچھی انگریزی اور تعلیم کے لیے نجی سکول میں بھیجا لیکن مجھے نہیں معلوم تھا کہ وہاں اس کے ساتھ ایسا سلوک ہو گا۔'",
      "english": "He says: 'I run a small shop and I have two sons. I sent my younger son to a private school for good English and education, but I didn't know that he would be treated like this there.'"
    },
    {
      "urdu": "'میں نے اپنے بیٹے سے بات کی ہے۔ وہ شرمندہ ہے اور ایسا محسوس کر رہا ہے جیسے اس نے کوئی سنگین جرم کیا ہو۔'",
      "english": "'I have spoken to my son. He is ashamed and feels as if he has committed some serious crime.'"
    },
    {
      "urdu": "ایک بچے نے صحافیوں کو بتایا کہ 'اگر ہم ایک دن کے لیے بھی اپنا ہوم ورک نہیں کرتے تو ہمیں اس طرح سزا دی جاتی ہے۔ ہمیں کپڑے اتار کر کھڑے کر دیا جاتا ہے۔ بعض اوقات گارڈز اور ڈرائیور ہمیں مارتے بھی ہیں۔'",
      "english": "A child told journalists: 'If we don't do our homework even for one day, we are punished like this. We are made to stand with clothes removed. Sometimes guards and driver also beat us.'"
    },
    {
      "urdu": "ایک خاندان کے ایک اور فرد کا کہنا تھا کہ 'کوئی پرائیویٹ سکول کی فیس میں ہزاروں روپے لیتا ہے اور پھر بچوں کی ذہنی صحت بگڑتا دیکھتا ہے۔'",
      "english": "Another family member said: 'Someone charges thousands of rupees in private school fees and then watches the children's mental health deteriorate.'"
    },
    {
      "urdu": "طالب علموں کے والدین کا الزام ہے کہ 'بچوں کو سکول کی صفائی، جھاڑو لگانے اور پودوں کو پانی دینے کے لیے کہا جاتا تھا۔ اگر وہ غلطیاں کرتے ہیں، تو انھیں دھمکیاں دی جاتی ہیں اور مارا پیٹا جاتا ہے۔'",
      "english": "The students' parents allege: 'Children were asked to do school cleaning, sweeping, and give water to plants. If they make mistakes, they are given threats and beaten.'"
    },
    {
      "urdu": "والدین کی شکایات کی تصدیق کرتے ہوئے ڈسٹرکٹ ایجوکیشن آفیسر نے کہا کہ 'ہماری تحقیقات سے یہ بات بھی سامنے آئی کہ نومبر سے پہلے کئی روز تک ہوم ورک نہ کرنے پر بچوں کو سردی میں ہر روز برہنہ کرایا جاتا تھا۔'",
      "english": "Confirming the parents' complaints, the District Education Officer said: 'Our investigation also revealed that before November, children were made naked in the cold for several days for not doing homework.'"
    },
    {
      "urdu": "انھوں نے مزید کہا کہ 'اگرچہ ایسا لگتا ہے کہ سکول میں نظم و ضبط کو بہتر بنانے کے لیے ایسا کیا گیا لیکن یہ ناقابل قبول اور سخت ہے۔'",
      "english": "He further said: 'Although it appears this was done to improve discipline in the school, it is unacceptable and harsh.'"
    },
    {
      "urdu": "تحقیقات میں تمام الزامات درست پائے گئے ہیں۔ سکول پر عائد ایک لاکھ روپے کا جرمانہ سات دن کے اندر جمع کرانا ہو گا۔",
      "english": "All allegations have been found to be correct in the investigation. The fine of one lakh rupees imposed on the school will have to be deposited within seven days."
    },
    {
      "urdu": "اگر مستقبل میں ایسا واقعہ دہرایا گیا تو سکول کی ایکریڈیشن منسوخ کر دی جائے گی۔ پولیس فی الحال تحقیقات کر رہی ہے، جس کے بعد مناسب قانونی کارروائی کی جائے گی۔",
      "english": "If such an incident is repeated in the future, the school's accreditation will be cancelled. The police is currently conducting an investigation, after which appropriate legal action will be taken."
    }
  ]
}
